[
  {
    "Title": "Good Choice If On A Budget",
    "Rating": 4,
    "PublishDate": "7/9/2011 7:07:38 AM",
    "LoginNickName": "AnXRockStar",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Minor: ISO and White Balance not readily adjustable.  Face/smile/blink detection not perfect... I've gotten a few shots of nothing because it paused and then snapped after the subject moved on.  EVF or LCD, not both, and it defaults to LCD with no way that I can find to set it to EVF.  No thread mounts for filters or extenders.\nMajor:  No cover for the LCD.  It's just the soft touch-it-and-get-swirls type.  It's also inset, making the peel and stick type difficult to apply.  I did put one on, it doesn't fit right and has bubbles, but I'm afraid to pull it off.  (Or use the squeegee that came in the package)",
    "Pros": "Image quality as good as any at this price that I've seen.  In fact, better than a few that I looked at that were quite a bit more expensive.  Face detection, smile detection and blink detection.  Surprisingly good glass.  (Considering the whole camera costs less than an entry-level long zoom lens.)  Advanced auto focus modes available.  Plenty of resolution... if you're primary application is 4×6 prints or slide shows on a monitor or HDTV, the digital zoom is actually useable.  Lots of preset scenes available.  Auto focus seems fairly quick, but I couldn't really compare that aspect to the competition in the store.",
    "Comments": "Overall, it's a really good camera for the price.  I've been able to get some nice pix, and I'm still on the included alkaline cells.  Time will tell if the LCD will hold up.  Just don't pay 3 \"Ulysses-es\" and expect it to outperform one that costs 2½× as much.  (Something Newegg's reviewers do with annoying regularity.  \"This pile of junk 3GHz CPU will only let me go to 3.6.  I want 4!\"  Then PAY for 4, or be happy it \"gave\" you .6 for free!)",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]