[
  {
    "Title": "Excellent for underwater adventures",
    "Rating": 5,
    "PublishDate": "9/16/2014 11:17:24 PM",
    "LoginNickName": "Nick",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Battery does not last long.  You will want to buy some extra batteries and a charger.",
    "Pros": "Comes with all the items you need to capture amazing videos.  I used a lot of the 2.7K 30fps video on a trip to Hawaii and it handled sand, water, rocks, and mud perfectly well.  The quality of the video and photos is very good too.  It's a great way to capture experiences that you wouldn't dare subject your DSLR or other camera to.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Gopro 3+",
    "Rating": 5,
    "PublishDate": "8/10/2014 8:50:58 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Battery life is a little to short. Most venue it is probably fine mine use requires a longer operating life.",
    "Pros": "Versatile, fast, creative, unbelievable image and video capture. Easy to operate. WOW WOW WOW. No ends to the ability to create exiting content. Created great videos right out of the box. No experience required. Easier than a standard SLR.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Pretty disappointed so far",
    "Rating": 2,
    "PublishDate": "8/8/2014 11:46:53 AM",
    "LoginNickName": "Pasadena Bill",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Here's where I have issues with the GoPro. Right off the bat, there is no viewfinder so if you want to see what you're recording you need to purchase the optional viewfinder. Ka-ching!\n\nThe camera operates VERY HOT. You will not want to hold it in your hands, let alone stick it in your pocket without a plastic cover. Thus, you must put it in a plastic cover (included with camera), but that adds a lot of bulk to the camera, so now it doesn't fit in my pocket. So for handheld, discreet filming, this isn't a good choice.  The old CISCO cameras, FLIP, ere really good at tossing in a pocket and staying cool, but they are not available anymore. \n\nThe distortion on the edge of the image is very noticeable. If you are a picture fanatic like me, this will likely bother you. \n\nThe camera takes some getting used to to operate. And the buttons to film are so sensitive I have filmed the inside of my jacket or pocket many times, arriving to a place I want to film only to find that the battery is dead and the Micro SD card is filled. \n\nAccessories. To get the real value of the camera you must buy accessories. Plan on purchasing a viewfinder, a spare battery, at least two clips, a battery charger, and then a case to put all these accessories in. Ka-Ching!\n\nThe sound is not great and if you put the optional viewfinder and case on it, the sound is downright terrible.",
    "Pros": "I was very excited to get a GoPro as I wanted a small camera to take places and also use for recording guitar lessons, being able to attach it to the headstock of a guitar and get a shot down the guitar fretboard. \n\nThe camera is small. And when you order accessories, it seems everyone sends you lots of clear cases to put the camera into.  \n\nThe video quality is very good, although the outer edges are distorted. This may be nice on a surf video, but if you're documenting anything for accuracy, it will leave you disappointed. \n\nThe price of the camera itself is good. It's all the accessories you need to buy to make it useful that adds up.",
    "Comments": "So close but so far. I can see mounting this to a bike, surfboard, or other outdoor, action type object and I have seen many great videos shot with a GoPro. It just didn't do it for me.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]