[
  {
    "Title": "Slower than the  DSC-N1!!",
    "Rating": 4,
    "PublishDate": "8/31/2007 9:15:35 AM",
    "LoginNickName": "Chad",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "This camera is a little slower than the original one. The responding time when turning it on is slower and even when panning through pictures. Still is a great camera! Can't go wrong with the 3\" touch screen.",
    "Pros": "I bought the 1st generation of this camera about a year ago (SONY DSC-N) and i loved it! I took it everywhere with me, very durable, dropped it a few times with no problems...and then one day the screen cracked form misuse. So i decided to buy this one because it had 10.1 MP",
    "Comments": "I think Sony was the first to come out with a 3\" LCD touch screen. It's so easy to use and has minimal buttons on the physical camera. It's funny to hand your camera to a friend and they can't figure out how to look at the pictures..LOL",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Sony DSC-n2",
    "Rating": 5,
    "PublishDate": "8/10/2007 8:45:26 AM",
    "LoginNickName": "JMR",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Not enough optical zoom but for me it isn't that big a deal",
    "Pros": "takes great close ups and at 10MP, you can zoom in keeping the detail.  I took a picture with no zoom on the 39th floor of a building and could increase the size enough to be ablt read a street sign.  It also takes great movies, which is a real plus because I didn't think it would.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Quality",
    "Rating": 5,
    "PublishDate": "6/5/2007 2:54:48 PM",
    "LoginNickName": "liqNitro28",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "No external memory card.  Doesn't take regular microSD memory.",
    "Pros": "Great quality photos!  I received one of these from work for a bonus we do and I love it.",
    "Comments": "Will probably want to purchase an extra battery so you always have one charged as well as a case.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Awesome camera",
    "Rating": 5,
    "PublishDate": "5/16/2007 7:23:06 PM",
    "LoginNickName": "Travis",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "No viewfinder, but not a huge drawback since so far it has been easy to use the screen for viewfinding in most light conditions.",
    "Pros": "Outstanding picture quality, menus are easy to navigate (for me anyways), nice screen, good battery life.  Shutter time is very good, the fastest I have ever seen so far for a camera of this size.",
    "Comments": "I bought this to replace a Cyber-Shot DSC-P92, and I could not be happier.  This is by far the nicest compact camera I have ever used.  I am using a 4gb Sandisk Ultra II memory stick with this camera.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Buy",
    "Rating": 5,
    "PublishDate": "5/15/2007 1:31:49 AM",
    "LoginNickName": "Seth",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "25MB of internal memory is not much. only 5 pictures at 10MP without extra memory card.\nwhich a 2-gig card will take over 300 at 10MP and over 9999 VGA shots. Battery recharger takes a while and disposable batteries are not an option, but battery life is good.",
    "Pros": "Great wide screen pictures. 3 Inch touch-screen is easy to use and makes for easy viewing. Great Pictures near and far. Manual settings let you control many things including exposure settings, focus settings, and ISO up to 1600. video functions are amazing, good in lower light compared to my last cam. Long battery live is a plus. 10 MP's makes for stunning pictures. The ease of use is great, it is a true point and click on automatic setting.\nTripod ready. and cool slideshow feature with changeable music. Macintosh friendly.",
    "Comments": "only 3x zoom, but 10MP clearly makes up for this, and on that note 10MP may be more than I need. No viewing hole, just a LCD screen (which is all I have ever used).\nSo far even in direct sunlight i have had no problems seeing the LCD screen, so this is not a con to me.no \"stability shot\" like feature at least to my knowledge, but I have run into only a few blurry pictures.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "A really good all around camera",
    "Rating": 5,
    "PublishDate": "2/6/2007 3:42:34 AM",
    "LoginNickName": "Kent",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "There is no included memory stick, but there is 25MB of internal memory. I purchased a MS Pro Duo 4G stick and can fit 9999 pictures at email resolution(VGA) and nearly 800 at 10 megapixels.  The charger is cheap and requires you to remove the battery to recharge, so I purchased the AC-LS5 power adapter for low battery or continuous use.",
    "Pros": "I bought this in silver and have been extremely happy with my choice. The 3\" touch screen is really handy and easy to use without the stylus. The case appears to be metal and is very sturdy and compact. Pictures and videos are beautiful and seem to defy their origins from a compact camera. The menus are easy to navigate and offer photo editing capabilities that are neat, but which I'll never use. I would recommend this camera to anyone looking for top-of-the-line photos from a compact point and shoot camera.",
    "Comments": "I purchased this while on active duty in Iraq to replace a failed DSC-F717 (not so portable), which I'm very fond of.  The picture quality from such a compact camera is truly stunning. Certainly, this is no professional camera so those looking to use manual modes might find better choices elsewhere (although they do exist on this model).  This camera is clearly designed to make taking great pictures simple.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]