[
  {
    "Title": "Love my D200",
    "Rating": 5,
    "PublishDate": "2/19/2007 10:53:17 AM",
    "LoginNickName": "Ken",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Not cheap.  Cannot 'lock' custom settings.  No manual focus screen (get a Katz Eye screen), electronic focus 'assist' for manual focus not very useful.  Note this only applies to older manual focus lenses.",
    "Pros": "Fantastic image quality, weather-proof, amazing build quality, works with 30 year old lens.  Improved my photography skills.",
    "Comments": "I've been using Nikon F series cameras for 30 years.  I've been waiting for the 'perfect' digital SLR and this is near perfect.  Since I have a lot of manual lenses, I wanted a body that would work with them.  Adding a 3rd party focus screen made this camera perfect. I'm still learning new things this camera can do, even after a year.  If you want access to Nikon glass (lenses), and a pro body with a sub-$2000 price, this is THE camera to get.  There is an amazing amount of old gear that works with this camera.  Simply fantastic.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Bought it for the viewfinder...",
    "Rating": 5,
    "PublishDate": "2/16/2007 11:17:03 AM",
    "LoginNickName": "sideshow_Rob",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "That damned 18-200 VR lens is still almost impossible to find! I also wish Nikon would standardize on a battery; I'm kind of miffed that my batteries and charger from the D70 won't work on the D200 despite being nearly identical. Bad form.",
    "Pros": "I upgraded to this camera from an original D70, no regrets at all. for me, the viewfinder was the selling point, it's what you would expect from a \"pro\" grade film SLR; it's bright and huge. Anyone who's spent time actually composing shots will apprecite it over the tiny viewfinders in most DSLR's. You can look through this thing all day without fatiguing your eyes. Build quality is very high; this thing feels as solid as a German Panzer... and weighs about as much.",
    "Comments": "This is still a great camera, but it is getting long in the tooth for a DSLR - it's been shipping for about 16 months now. I'm sure its replacement is almost here...",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "D200, A great camera",
    "Rating": 5,
    "PublishDate": "2/15/2007 2:59:01 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The battery life is short. A spare battery is a must.",
    "Pros": "The D200 is really a lite D2x not a beefed up D70/D80. Be prepared to spend another $1200 to get a SB-800 flash and Nikor lens to make this baby perform properly.",
    "Comments": "I didn't know that Newegg was an authorized Nikon dealer. Something to think about.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "D200 is ALOTof camera",
    "Rating": 5,
    "PublishDate": "2/14/2007 9:43:28 PM",
    "LoginNickName": "Ravashaak",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Default in-camera sharpening is a little on the soft side.  This has led to some people mistakenly referring to the D200 as soft.  However, all that is needed to remedy this is to bump up the in-camera sharpening.\n\nI suspect that the Nikon \"D200\" neckstrap is actually a cable saw in disguise.  I replaced mine with a nice neoprene one. Ahhhh!",
    "Pros": "The build quality and ergonomics of the D200 are just amazing!  Believe people when they say the camera \"just feels right\" - it does.  Button layout and placement is top-notch.\n\nThe camera is for the most part built like a tank.  I could swing the camera by the neckstrap and kill you with it.  It feels that tough and has that kind of heft to it.  And it has weather seals!  At this price range you won't find that very often.",
    "Comments": "This is no beginner camera.  There are some incredible point-and-shoot cameras on the market these days. Make sure you need the features of the D200 before you buy it.  If you want to shoot point-and-shoot style, then buy a point-and-shoot.\n\nI would also suggest getting a second battery.  It's been well worth it to me. \n\nThe D200 is not a small camera.  You will need to employ some strategy if your shooting requires you to be inconspicuous.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Excellent Device",
    "Rating": 5,
    "PublishDate": "11/8/2006 12:23:39 PM",
    "LoginNickName": "SevenT",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Don't like the BIG \"Nikon D200\" on the strap. Its too ostentatious for me. I don't need to brag. Those that know, know what the camera is, and those that don't, well the D200 sign would mean nothing to them anyway. Heck, I had to find something that I didn't like so much.",
    "Pros": "I now understand what reviewers meant when they said the camera was \"just right\". Have used numerous cameras over the years and a number of digital models. Stepped up from a D70, and everything on the D200 is that much better. It literally \"feels\" better as you use it.",
    "Comments": "If you don't know why you should be getting this camera, then its not for you. This is a precision instrument meant for those who know what they are getting into, and who can make it work to the best of its ability. Sure, in auto mode it will work for anyone, but if that's all you want it for, rather get something else - this would be way overkill.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Fast Ship! Grey Market!",
    "Rating": 4,
    "PublishDate": "11/2/2006 9:33:07 AM",
    "LoginNickName": "A64",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Grey Market!",
    "Pros": "The camera was here in 3 days, works better than the D70's by far.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Outstanding camera",
    "Rating": 5,
    "PublishDate": "10/14/2006 9:50:39 AM",
    "LoginNickName": "buffmaloney",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "I don't have 2 of them. :o(",
    "Pros": "Many features. Solidly built. Great balance. Excellant metering, focusing, very versatile.",
    "Comments": "This camera is well worth the money. If you just want point and shoot, this will do it, but you will be wasting a wonderful camera.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Couldn't be happier unless I had the D2Xs",
    "Rating": 5,
    "PublishDate": "10/3/2006 8:09:11 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None yet",
    "Pros": "What a gem!\nExcellent, crisp and rich images with my Nikon \"D\" lenses. Also compatible with manual focus lenses with certain limitations. Programmable data input for most manual focus standard and zoom lenses.\nExtensive flash capabilities (studio,macro,etc.).",
    "Comments": "Having the ability to use my manual focus 105 2.8 macro and 300mm lenses and older \"D\" series auto-focus lenses is a huge bonus. Takes some time wading through the many features...but hey, that's half the fun since it's much cheaper than burning through rolls of film. Certainly more features and more time to learn than my Olympus C2100 and Nikon 8008s.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]