[
  {
    "Title": "Excellent camera! I know cameras!",
    "Rating": 5,
    "PublishDate": "8/10/2013 10:34:21 PM",
    "LoginNickName": "darius",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "camera tends to loose focus in a very low light even with focus assist. Not possible to set it manually though.\nI'm hoping it can be fixed through firmware update since the camera hardware is spot on.",
    "Pros": "I have bought this camera for my work. I shoot a lot of pictures. I require my camera to:\n- perform excellent in low light\n- have replaceable batteries option\n- make sharp pictures\n- fast\nThis Nikon has all that. Its very fast - can shoot picture after picture - no waiting time.\nFlash loads within 2 seconds - this is very fast (alkaline batteries_)\nCMOS sensor performs way better in low light than any other sensor.\nLens in this camera is phenomenal (by compact camera standard of course) pictures come up very pleasant to the eye.\n16Mpix fine gives you best picture quality and about 7MB in size. Excellent JPEG compression with 8MPix and picture size below 2MPix.\nSolid build quality - feels great in hand with its mini grip ;-) looks great, great materials",
    "Comments": "Not many options.\neverything pretty straight forward - all automatic\nNo control of Aperture size - all set automatically \nCamera made simple to use.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "NIKON L610",
    "Rating": 2,
    "PublishDate": "6/11/2013 7:04:40 PM",
    "LoginNickName": "CONAN OF ROTTINGHAM",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "After having this a month and fiddling with the owners manual and every color option I got the color for still images somewhat manageable.  The Autofocus is another story for still images. It will attempt to autofocus and get everything sharp looking, but 1 second before snapping picture it blurs slightly then snaps the photo(even on a tripod). I tried everything and the only thing left for me is to read the owners manual and see if I can resort to manual focusing and never use auto again.  The HD video in this camera seems to work fine. If I had to do this again I wouldn't buy this camera.  Battery Life is a dismal if shooting continuous HD VIDEO. You'll get about 20mins max on fresh batteries.",
    "Pros": "Great HD Video at 1080p, Camera Looks Stylish and Feels Structurally Strong. Boasts 16megapixel Still Photos. What more could you ask for? I purchase this locally from B*** B**, but wanted to leave people with info on this camera.",
    "Comments": "This replaced a lost 5 megapixel Sony Cybershot and how I miss that Sony for Still Images.  That Sony was bad for Video as it was only 640x480 video...but the still pics were always crisp and superb.  My next camera will be a sony again.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Terrible Camera",
    "Rating": 1,
    "PublishDate": "3/17/2013 5:52:50 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Terrible pictures.\n1) color is off, many pictures have a bad color shift, many are washed out\n2) fuzzy, far too many pictures come out blurred and fuzzy\n3) drains batteries, might work for an hour then needs new batteries, try to record motion and it indicates batteries are too low, even with new batteries\n\nGetting a good picture out of this camera is a struggle",
    "Pros": "Lots of functions",
    "Comments": "Wish I had returned this camera when I had the chance, unfortunately I waited to go hiking to try it out and judge it and it is terrible.\nIf I can sell it at our next yard sale for $30 I'll be glad to get rid of it",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera. Poor zoom",
    "Rating": 3,
    "PublishDate": "2/16/2013 6:18:13 PM",
    "LoginNickName": "w4grt",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Alkaline batteries ARE a con. NIHM batteries work great with this camera. \nThe real deal breaker with this camera is the zoom. Zoom a few feet, the viewfinder is out of focus,. A couple seconds later, it's in focus. Opps, I zoomed too much because the viewfinder was out of focus. Zoom back. Out of focus again. Opps, I zoomed back too much....Very frustrating \n\nData is slooool to load to the card",
    "Pros": "1.) A CMOS imaging chip. Always considered to be step up from the much more prevalent and less expensive CCD sensors.\n2.) 16 MB max image data size (4608 x 3456 pixels, that's a lot).\n3.) 14x Zoom lens with a wide angle start. This is such a big deal to me to have built in wide angle zoom lens, this one starting at a very nice 25mm. This is what most small point and shoots can't deliver. The wide angle start. Also, the built in Macro setting of this lens delivers outstanding close up images. The world is breathtaking from 1/2 an inch away.\n4.) USB 3 interface. This is still a rarity in cameras as of this writing. Excellent for moving those 1080P videos.\n5.) 1080P recording! Even this cameras bigger brother (the Coolpix L810) is only 720P.\n6.) AA batteries. Able to pick up a pair anywhere and keep going (but there is a real downside to this. See Cons).\n7.) The flash will not (can not) pop up on its own. If it warns you that you should be using a flash and you don't wish to, than the camera will recalculate the image settings by slowing the shutter speed, raising the ISO to get you a grainy image but that control is left up to you.",
    "Comments": "I bought this camera from a local retailer. **** Buy.\nI returned it and bought a Nikon S8200.  \nThe S8200 is a much better buy, having a normal operating zoom, LIO battery that recharges in the camera and has all the pros above. The S8200 does not have the manual pop up flash which I like and prefer, however.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great multipurpose carry camera",
    "Rating": 5,
    "PublishDate": "1/6/2013 7:52:19 PM",
    "LoginNickName": "Brianod",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "No shutter or f stop based manual settings. One must choose from one of the scene modes but this is okay for me. Once you realize each scenes built in settings you can still choose to use a scene that has more relevant shutter and f stop settings for the image you really want. For example the Fireworks scene hold the lens wide open and slows the shutter speed but that setting could be used in the daytime for a specific effect.\n\nThe AA batteries are convenient but this camera sucks the power from standard alkaline batteries rapidly. So the convenience of AA batteries is both good and bad. I have to get a better NI-cad charger to realistically power this camera. Rechargeable lithium would of course be the best batteries (and the most expensive).\n\nNo uncompressed jpg and no RAW settings for file saving. When you have a CMOS imager that's 16 Meg you would prefer to save that file as near to virgin as possible.\n\nNo SD/XD card shipped with teh camera so I got this from Newegg SanDisk Extreme 32 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s. It's fast and very high capacity and a camera like this needs something like this or equivalent card. They're not expensive.",
    "Pros": "I bought this camera from Newegg Thanksgiving 2012 and this is now January 2013 and no one has written a review? That's too bad because it's a very nice camera. This purchase was definitely an impulse buy on that big sale day Friday. This camera had many things on my checklist.\n1.) A CMOS imaging chip. Always considered to be step up from the much more prevalent and less expensive CCD sensors.\n2.) 16 MB max image data size (4608 x 3456 pixels, that's a lot).\n3.) 14x Zoom lens with a wide angle start. This is such a big deal to me to have built in wide angle zoom lens, this one starting at a very nice 25mm. This is what most small point and shoots can't deliver. The wide angle start. Also, the built in Macro setting of this lens delivers outstanding close up images. The world is breathtaking from 1/2 an inch away.\n4.) USB 3 interface. This is still a rarity in cameras as of this writing. Excellent for moving those 1080P videos.\n5.) 1080P recording! Even this cameras bigger brother (the Coolpix L810) is only 720P.\n6.) AA batteries. Able to pick up a pair anywhere and keep going (but there is a real downside to this. See Cons).\n7.) The flash will not (can not) pop up on its own. If it warns you that you should be using a flash and you don't wish to, than the camera will recalculate the image settings by slowing the shutter speed, raising the ISO to get you a grainy image but that control is left up to you.\n8.) HDMI output. The movie quality is excellent when shown on a large screen HDTV.",
    "Comments": "When you change battery types there is a setting in the menus to select the correct type (alkaline, ni-cad or lithium) to manage the power drain as efficiently as possible.\n\nThere are two settings on the max image resolution settings. The one with the star next to it is saved with much less jpg compression for a larger file size but less grainy image. This is the setting I use for the best possible, highest resolution image I save.\n\nI couldn't eyeball a case for this online so I went to a Big Box store (something Mart) and tried cases for size in person. I ended up with an inexpensive Case Logic TBC403 which fits this camera perfectly with the ability to carry 6 AA batteries in the case. It's a soft case.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]