[
  {
    "Title": "Exceeded Expectations",
    "Rating": 5,
    "PublishDate": "6/28/2011 11:20:31 AM",
    "LoginNickName": "Aundy",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Camera neck strap is uncomfortable.  Spend a few bucks for a strap that doesn't cut into your neck.",
    "Pros": "I've been taking pictures for about 12 years as a hobbyist.  This is my first DSLR.  I wont have the same understanding as a professional photographer, but I will have the perspective of a general consumer.\n\nMy wife and I wanted something that would capture our two fast moving children:\n  \n-Auto and iAuto yield outstanding photos for users who dont want to mess with a bunch of settings.  The usability is that of a large point N shoot with the quality that looks professional.  \n-My wife doesn't have as sharp of an \"eye\" so the 10 Frames Per Second allows her to capture action photos that she'd otherwise miss.  \n-Autofocus Video works well for objects moving around a backyard.\n-SCN presets are really great when trying to optimize certain types of photographs.  \n-LCD full tilt has shown to be way more useful than originally expected.\n-Fit and finish of the camera make it feel really solid when gripped.  \n-Custom presets can be adjusted quickly with a little practice.",
    "Comments": "Other reviews have stated that the battery life is meh, but I havn't owned another DSLR to compare this statement.  \n\nApparently the Electronic View Finder decreases battery life, but allows for much better response.  It's kinda like a double edged sword.  With the amount features on this camera that come as a result of the EVF, I gladly take the tradeoff.  \n\nMusicians make music with instruments that they are passionate about.  In the same way, we've gotten really excited about our photography because of this camera.\n\nOur experience with this camera has us really enthusiastic about taking photography to the next level.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Sony A 55",
    "Rating": 5,
    "PublishDate": "6/26/2011 1:17:30 AM",
    "LoginNickName": "Hero",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "the kit lens it comes with. the 3.5-5.6/18-55 SAMS Sony lens. is alright for a start lens but i recommend getting a lens of your choice whenever possible. The lens still has pretty quick focus. in low lighting it has a little bit of trouble but thats nothing manual focus cant fix. also i recommend to get a spare battery for the camera.",
    "Pros": "I recently got into SLR cameras. I researched, read reviews, watched videos on countless cameras for about a month. My budget isn't the highest one. But when i came across the A 55 i knew its the one i wanted. I ordered it and it took 1 week to get to me. Im a deployed soldier so it shipped APO. when i got the camera it was perfectly fine. nothing was missing broken etc. I was very pleased. This camera is amazing especially for beginners. There is so many different things you can do with this camera. Im still finding new things to do with it. The 10fps is amazing. The panorama is very good to. the video is excellent. some people have said that when they shoot video the camera over heats mine doesn't do that. And the GPS function works very well. and it does work over seas. well in middle eastern countries.",
    "Comments": "overall this camera is very good especially for its price",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "4/25/2011 11:00:27 PM",
    "LoginNickName": "DrG",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "It is not a studio camera.  For that try the A900 with full frame more subtlety in the viewfinder and 25 MB sensor in the Nikon @ 4x the price.",
    "Pros": "Had a friend bring this to me in India.  It was the perfect travel camera.  Very fast focusing system, lightweight with 18-250 Tamron/Sony lens and good low light functioning.\n10 shots/sec worked on the tour bus and GPS revealed where each show was taken.\nRecomended.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]