[
  {
    "Title": "Nice camera",
    "Rating": 4,
    "PublishDate": "6/17/2008 1:03:30 PM",
    "LoginNickName": "cf",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "noise problems at 100 iso , really slow raw editing software, small internal memory, cannot change card or battery when using a tripod, not to good movie mode,the manual focus is not that easy to use, and no hot shoe might be a problem for some people.",
    "Pros": "nice zoom, good close ups, powerful flash, easy to use, manual controls, panoramic photo software seems good, nice lcd, two speed zoom, supports vista, live histogram, joystick, li-ion battery and the buttons are all in a sensible place.",
    "Comments": "The zoom is great! It start off nice and wide. To match the zoom with a DSLR you need a huge lens. It does have noise(grain) problems at 100 iso in low lighting, ok iso preformance in good lighting and great iso preformance with the powerful flash on , but just try to stay at 100 iso . Sorry I don't know much about the scene modes because I dont use them but I suggest to stay away from high sensitivity mode. Burst modes are good with 2 frames per second till your card is full and four photos and three frames per second. don't like the intelligent auto mode because it will raise the iso automaticly. I don't use the printer mode and don't really use the custom mode program mode is good for me. The custom white balance works good too. Overall I really like it and would recommend it if you don't mind a bit a processing for large prints.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 4,
    "PublishDate": "4/3/2008 3:46:14 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The picture clarity was not as sharp as what I was used to on my old Canon.  Wish I had spend the extra cash.",
    "Pros": "This camera comes with tons of features for many types of shots and scenarios.  The 18x zoom can't be beat.",
    "Comments": "Decent buy if your not a stickler.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great but hold the presses",
    "Rating": 4,
    "PublishDate": "12/31/2007 1:33:14 PM",
    "LoginNickName": "rjrillo",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Functions poorly in almost any typical indoor lighting conditions. Noise is visible even at ISO 100. Anything above ISO 200 almost useless except for snapshot size prints due to noise. Shooting RAW will help.",
    "Pros": "Fantastic Leica lens, 18X zoom, RAW shooting capability, best feature set in price range.",
    "Comments": "None of the other reviews on this site have mentioned a real problem with a large number of these cameras that Panasonic has yet to address; the \"blue-band\" issue that many FZ18 owners are experiencing in which a blue-band is appearing on the left side of the image when the left side is much darker than the right. Check this link for more info :http://fz18.ruudabeln.nl/blueband.htm\nAs much potential as this camera has I would hold off on purchasing one until Panasonic comes up with a fix.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "lcd vs monitor",
    "Rating": 5,
    "PublishDate": "12/30/2007 3:57:44 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "In order to get the good pics in low light, You have to slow the shutter down and use a tripod. getting used to the camera is a pain. After that its good",
    "Pros": "The camera has a great zoom, good picture quality, and well in low light conditions. Night mode works really good too. powerful flash",
    "Comments": "the lcd does appear better than my 15\" lcd. the lcd is much more vivid and crisp. My 22\" monitor does show off the quality more. I think it has to do with how many DPI your monitor is. lower dpi monitors do bring more quality as lower dpi makes the pictures look slightly less than good. Good way to test this is print out a pic 4x6 and compare to your screen vs lcd. I think you will be 100% satisfied",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great for a Gift",
    "Rating": 4,
    "PublishDate": "12/28/2007 11:47:54 AM",
    "LoginNickName": "rockstar555y",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Needs some tweaking to achieve best image quality\nNot so good at night and image stabilizer doesn't work that well in low light conditions\nHonestly, pictures look much better on the camera LCD display than on monitor or TV",
    "Pros": "Amazing picture quality while taking pics outdoor with enough Lighting\nSharp Images even at 18X Zoom\nSupport for SDHC cards",
    "Comments": "Use it for taking holiday photos, maybe while travelling but you are better off with something else in a party/club/social gathering.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Pro Enough",
    "Rating": 5,
    "PublishDate": "12/25/2007 3:17:03 PM",
    "LoginNickName": "Mikenphx",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Not a fan of proprietary batteries, had to buy a second one as a back up on hand when out shooting.  Regular batteries have one advantage of being available any where when you are in a pinch.",
    "Pros": "This camera is on of four 18X ultrazoom cameras available right now and after much research the Panasonic is truly the best.  It is very easy to use, the Intelligent Auto mode makes the amateur look good and is great for a quick shot with out much thinking.  The zoom is amazing and with image stabilization works impeccably.  This is hands down the best camera I have had.",
    "Comments": "This camera is perfect for those who want more of a camera than those little pocket cameras but are not ready for DSLR's.  It is a PROSUMER model in my mind just under the DSLR line.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "12/18/2007 2:12:24 PM",
    "LoginNickName": "CCPLP1",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "A LITTLE BIT LARGER THAN COMPACT MODELS.",
    "Pros": "VERY EASY AND FUN TO USE, EXCELLENT PICTURE QUALITY, 18X OPTICAL ZOOM, GREAT BATTERY LIFE & FLASH RANGE AND LIGHT WEIGHT (COMPARE TO OTHER SUPER ZOOM).",
    "Comments": "A MAXIMUM OF 28.7X OPTICAL ZOOM CAN BE ACHIEVED WITH NO PICTURE QUALITY DETERIORATION BY USING EXTENDED OPTICAL ZOOM(EZ).\nTHE MAXIMUM DIGITAL ZOOM WITH USE OF EZ WILL BE 115X BUT PICTURE QUALITY DROPPED.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "I Love this Camera",
    "Rating": 5,
    "PublishDate": "12/17/2007 10:16:46 AM",
    "LoginNickName": "pdwhite",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Nothing to complain about...",
    "Pros": "I bought this camera only a few days after it was released here in US.  – The low light capability, 18X zoom, Leica optics, and many other features were like nothing else in this price range.\n\nIn November, I went on a rainforest and coffee plantation tour of Costa Rica. The photos and videos I shot there with this camera are amazing. The Jpegs are great, but the RAW images are just amazing.  I got wide screen DVD quality videos, snaps of humming birds feeding, tropical rainforests, night time photos in the jungle, monkeys in the trees and people in the cities, indoors, outdoors; all handled beautifully by this camera\n\nIf you are looking for an excellent camera without spending big bucks, this one is definitely for you.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "No brainer",
    "Rating": 5,
    "PublishDate": "12/13/2007 9:20:11 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "I'd prefer a smooth finish to the rough matte one.",
    "Pros": "8MP, 18x optical zoom, Leica wide-angle lens, huge vivid LCD, comfy grip, user-friendly, more features than you could possibly imagine.",
    "Comments": "Easily the best camera in the ultra-zoom market.  Panasonic has really done the necessary work to become a true camera power.  Their electronic ingenuity, combined with Leica's optical perfection, results in one deadly image-producing machine!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "if you are considering this",
    "Rating": 5,
    "PublishDate": "12/10/2007 8:33:48 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "doesn't use AA batteries!!! that is about it. Doesn't swim, don't cook, doesn't clean, takes to much of my time away. \nCAUTION!!\nyou will be spending more time than you should with this camera",
    "Pros": "get it simple. If you are comparing this camera and others. stop there. Get this one. I've tested every sub 400 dollar camera out this is the best. \nbattery life is sufficient I'd recommend another battery for long use. \nmacro mode-1cm focal range\n18x zoom\nsdhc compatable\ncrisp images\nraw format ( I won't use it much but, its there)\nno lens distortion at 18x zoom\nnight pics are good\nmanual mode is amazing. auto mode works great too\nshutter control\niso control\naperture control",
    "Comments": "if you are in debate quit. c@n0n is great but, not comparable in the total package.  s2 s3 s5 none are gunna be worth it unless you want a flash shoe. but, you are buying a point and shoot over slr so why do you want that?",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]