[
  {
    "Title": "I'm back",
    "Rating": 4,
    "PublishDate": "11/17/2009 8:00:51 PM",
    "LoginNickName": "Kharouf",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "the video works perfectly and the zoom also the only point is that during the focus change the video get fuzzy, but then the camera focuses it self nicely\nthanks Newegg",
    "Pros": "look above",
    "Comments": "Newegg customer srevice responded promptly to my return request and I got an other camera 7 to 10 days later. the out of focus problem (see previous review above) during the video recording was solved by pushing slightly the shutter button before starting recording ;-)\nthanks New egg",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Poor Focus when recording video",
    "Rating": 1,
    "PublishDate": "10/28/2009 9:42:11 AM",
    "LoginNickName": "Kharouf",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "the video function has a problem; I don't know if it specific to the item I bought or it's a general feature in this model but when trying to zoom while recording the picture is never focused, the camera tries to focus it but always stops at a point where the picture is out-of-focus. if I don't use the zoom the video is perfect but it's a big loss, I think, to have 10x optical zoom Being enable to use it",
    "Pros": "- you pay for what you get, good camera w HD pictures for a good price\n-10x zoom and 10Mp resolution this is actually what got me to buy it",
    "Comments": "I contacted Newegg the next day I received the camera (I spotted this malfunction the same day I received it) and they emailed me an RMA. I'm going to send it back and see what will happen. I will keep this review updated until it gets solved",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Continued excellence",
    "Rating": 4,
    "PublishDate": "10/9/2009 8:53:49 AM",
    "LoginNickName": "Ram-Z",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "This was listed as an easy share camera but it did not use the Easyshare III Camera dock like my z885.  My fault for not looking at that a bit closer.\n\nAlso could not reuse the VR6 dual lithium batteries I had for the Z885 (guess the wife gets more rechargables for her Z1285).",
    "Pros": "10x Optical Zoom, a great feature.\nslightly larger than those slim cameras.  This camera fits better in my hand.  \nQuality increases over time at the same price point.  This replaced my Z885 but had a better zoom and higher resolution as well as the slightly larger size.\n\nDoes use the LR6 rechargables (2500ma batteries).\n\nMovie mode is pretty good but needs a decent light source.  They can come out grainy otherwise.\n\nAdded a button just for the flash capabilities so you don't have to go into menu mode to manipulate the flash.",
    "Comments": "I used to do my own film processing and had the entire gamut of telephoto lenses etc, on my old 35mm SLR set up.  With the exception of very high quality, distant shots, this Kodak line has been used by my family for the last five or so years and my 35mm hasn't seen the light of day in that time. With this 10x zoom, it will be interesting to see on my next trip the quality of shots from farther away.\n\nWIll definitely keep buying Kodak with what I have seen so far.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]