[
  {
    "Title": "worst camera ever!",
    "Rating": 1,
    "PublishDate": "3/6/2010 5:44:59 AM",
    "LoginNickName": "asg",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The usb connection wont fit properly into camera to transfer photos. \njust terrible!\nI purchased a Kodak Mini Charger an 2 AA Ni-MH batteries but they won't power the unit. It doesn't work!!!\nTheir own rechargeable batteries don't work with their camera.\nHow insane is that?\nI'm returning this when I get back from vacation.\nAt the rate this thing is eating through batteries, I'm out another $30 in AA batteries plus the cost of the charger and Ni-MH batteries.",
    "Pros": "it takes pictures",
    "Comments": "Do not purchase this camera! \nNo matter what it costs!!!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Slim, compact, quality camera",
    "Rating": 5,
    "PublishDate": "9/25/2009 8:16:25 PM",
    "LoginNickName": "That1Guy",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Zoom could have been optical instead of digital (size would have to be bigger for this to be possible) i had to find A con for it.",
    "Pros": "Everything that you would want in a camera: ease of use, responsive, good image quality, small size(not smallest but close) yet has a big view screen which is nice. Auto focus works well, unlike most that i have used. Reviewing pictures is easy and simple. I would definitely purchase this again",
    "Comments": "If you are in the market for a camera I highly recommend it, you won't be disappointed. Except if you are that one guy that seems to find fault in pretty much anything. (FYI I have no ties with Kodak nor NewEgg.) Thanks for leaving reviews so i can purchase smarter.\n\nThat1Guy",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Nice cheap camera",
    "Rating": 4,
    "PublishDate": "9/18/2009 2:10:43 PM",
    "LoginNickName": "evlwaz",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Zoom not what I would like it to be........",
    "Pros": "Wont get much better for your money, nice software interface, my non-techie wife had it set up and was editing photos in about three minutes.",
    "Comments": "Worth the price.  Great point and shoot camera,",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]