[
  {
    "Title": "I like it",
    "Rating": 5,
    "PublishDate": "4/14/2013 1:41:11 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Low",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Video recording is pretty hard on the battery, but that's probably typical. I haven't tested extensively, but you could probably snap photos (outdoors in daylight, without flash) all day, but I'd estimate 45 minutes of just video.",
    "Pros": "Look, I'm going to be honest here, I don't know anything about digital cameras. \n\nHowever, I can tell you that I get appreciable photographs and Video/Audio recording out of using mostly the automatic settings. Outdoors on a sunny day, a high percentage of my photos turned out pretty great, and I could probably do even better with practice or manually setting the options.",
    "Comments": "If you see this camera on sale (like I did), consider grabbing it, because it'll probably beat anything else at the price point. At full price, I'd still recommend shopping around and reading some professional reviews.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Solid camera",
    "Rating": 5,
    "PublishDate": "8/7/2012 7:51:50 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Didn't come with a memory card but hardly a con about the camera.",
    "Pros": "Navigating through the camera is fast with an easy to follow interface, camera itself looks cool, pictures look great, large LCD screen -- steal for 100$.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Just Right",
    "Rating": 5,
    "PublishDate": "6/15/2012 4:50:56 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The screen is definitely hard to see in very bright daylight - I've got it adjusted to a darker exposure in order to get a true blue sky.  Like all the point and shooters I've seen (not really a problem with just this one) the image is very contrasty and the sky washes out if the shadows are well exposed and if the sky is blue then the shadows are a bit too dark.   If I really want the image, I'll use photoshop to correct it and so I tend to underexpose them a little.  To be honest I really do miss the subtlety of old school film emulsion.",
    "Pros": "Mostly I like the size and weight of it, slightly larger and heaver than others.  It allows for a decent grip with a place for my thumb.  Easy to hold and fingers don't accidentally press the wrong button.  Menus are good and there is dialog on screen for each of them.  Features and specs are comparable for the price range.  I like the battery included which eliminates the longevity problems and expense when using AA or AAA cells.  I'm using a 16 gb memory card and it holds more pics than I'll shoot in a year or two.  The mem card is a class 10 fast and it actually is pretty fast in high res.  Cam starts up quick.  I did not install any of the provided software, just notice that it reads as an external drive in Win7 and grab the images off it, then delete them from inside the cam in the same window.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]