[
  {
    "Title": "Simply the best!",
    "Rating": 5,
    "PublishDate": "3/29/2011 5:07:29 PM",
    "LoginNickName": "Knuckleheadfilms",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None.",
    "Pros": "Full frame.  Excellent low light capabilities.  Bokeh.  Superb kit lens.  Long battery life.  Compact when compared to professional video cameras.  24p.",
    "Comments": "This is my second 5D mkII, bought to use as a second camera for my film shoots.  I also own a Canon 60D, and while I love the rotating viewfinder on the 60D, nothing compares to the look of the 5D mkII.  If you've been on the fence, spend the extra cash and you will not be let down.  The best!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Nice, but 1 major FAIL",
    "Rating": 3,
    "PublishDate": "3/22/2011 5:48:16 PM",
    "LoginNickName": "MrAv8er",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Lets start with the small ones.  First, mode switch to the upper left of the view finder is easily bumped, which will totally change the camera operation.  Canon has a $150 modification that puts a lock on it.  Really? $150 for something that should be done at the factory?  Second, getting into the video mode is not easy or intuitive.  In fact, without the manual, I don't think you could get into video mode. But thats just nits to pick.\n\nNow for the biggie.  The imagery is junk, 90% of the shots are soft at high enlargement factors.",
    "Pros": "Nice ergonomics, intuitive menus for the most part, great big 3\" rear view LCD, easy to hold, great battery life.  Has great potential but...",
    "Comments": "I'm dissapointed.  After spending thou$and$ on assignment only to download 1,000+ crummy images, I had to spend more time and effort trouble shooting this brand new rig.  I find that the 24-105 F4 kit lens is BAD, right out of the box. Borowing another 24-105 F4 and a 70-200 F2.8 from a pro house, I found that at and between F4-F8, MY lens is NOT SHARP until it approaches F11.  While Canon customer service was excellent and they have a walk in service center only a few miles away, I still must lose this rig for \"7-10\" business days before I can go out and start all over again, now 2 months behind schedule.  At this point, they have had it almost a week and the website that supposedly tracks your repair order only acknowledges that they have the unit, but does not detail any progress.  With it being only 6 weeks old, I would have preffered Canon just provide me with a new replacement lens and be done with it.   After shooting Nikon for decades, this is not impressing me.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great upgrade",
    "Rating": 4,
    "PublishDate": "1/16/2011 11:56:29 PM",
    "LoginNickName": "HaloFX",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The auto focus system on the 5Dii is noticeably sub par compared to the Nikon D300 or D700. FPS is slower than the old D200, much slower than the D300/700. Although that isn't a big deal for my subject matter.\n\nI am really missing the on demand grid lines that Nikon and Fuji offer, have to change the screen on Canon. Also miss the voice memo feature, have to step up to a 1 series to get that on a Canon. Custom menu is nice, but Fuji has a better menu system. Canon includes a better software package than Nikon, Fuji has better tethered software out of the box. The 5Dii has impressive color, but still lags Fuji's color straight out of the camera. Also prefer Nikon's thumb wheel much better. The lock on the 5Dii's thumb wheel is clunky. It is either locked when I need it, or unlocked and gets bumped. \n\nRubber flaps on the side ports are clunky when using multiple ports at once.\n\nLive Mode hasn't been as useful as I had hoped.",
    "Pros": "Loving this camera! Great build quality. Low light ability is amazing! Pretty much holds true to all the great reviews I have read. The 24-105 lens is a great deal in the kit and performs excellent! Really loving the L Canon glass! Glad Canon includes a decent software package, including remote control software. Really happy to have Full Frame! Color rendition is better than Nikon.\n\nHD video is pretty slick, although not a feature I see myself using much.",
    "Comments": "This 5Dii kits really is a great package and I am very happy with it! However, it does show its age a bit, which is why I am docking an egg. Couple more months and I will probably forget most of the Nikon differences, except the grid lines and voice memo.\n\nProgram modes seem pretty worthless on a camera of this caliber. Although full auto means my wife might actually get a usable shot out of it! I am shooting on manual most of the time.\n\nPrice isn't a big issue, paid more for my previous DSLRs. Just a bit frustrating to lose features that I have had clear back to my 7 yr old Fuji S2, and some lower end Canon's have.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Amazing images!",
    "Rating": 5,
    "PublishDate": "10/5/2010 2:05:20 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Older 5D focus system that is fast only if you select the center focus point.",
    "Pros": "Image quality\nExcellent kit lens\nCanon lens selection\nExcellent video quality\nIncluded Canon DPP RAW software",
    "Comments": "Very large but very detailed 21 megapixel images with that great Canon color tones.  Smaller images size selection in the 11 and 5 megapixel range are sharper than any other camera in that native range such as Nikon D700.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "7/19/2010 10:57:04 AM",
    "LoginNickName": "deborah",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Price! None really.",
    "Pros": "Love the Focus Points, Fast Shutter, High ISO and HD videos",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Awesome",
    "Rating": 5,
    "PublishDate": "5/25/2010 10:50:15 AM",
    "LoginNickName": "MeDavid16",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "I had to RMA my first one, the glass was loose after ~100 photos. Newegg was not only quick, but courteous, and efficient, \n\nCalling price a con is inappropriate as well. You already know the price, this is the price of the product. \n\nThe Rebel T2L.... \n\nThe included lens is a pro as well as a con. Although it makes a nice walk-around lens, with this caliber of camer-body, I'd say Canon should consider variations of included lenses and adjust price accordingly. Package it with a Wide Angle, package it with a Macro, and adjust the price correspondingly. *shrug*",
    "Pros": "Full Frame, HD Video, rugged design, clear LCD, included lens is L grade, IS USM. People calling 21.1MP a con is inappropriate. Again, A) you can downgrade if you want, B) you already know that's what you're buying, C) It's full-frame, why not capture with high mp.",
    "Comments": "You get what you pay for. Sure the AF isn't as \"sporty\" as the 7D or the Mark 1, but nor is it a pinto by comparison.\n\nI've taken this chugger to many events and I have never been disappointed. I have two batteries, 4 lenses, a 580ex II flash unit, I feel pretty prepared for almost any situation. I went from an XTi to the 5DMK2... and I felt like my eyes opened for the first time.\n\nEmbrace Full Frame and HD glory, it's time and you know it.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "killer setup",
    "Rating": 5,
    "PublishDate": "3/29/2010 8:48:25 PM",
    "LoginNickName": "wildbirdseed",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "mono mic on video mode, but it's actually still pretty good.  complicated menu to get into live mode, and then from there to shooting live video.",
    "Pros": "Great camera, it's easy to understand why this unit has been the must have sidearm for all professional photographers for the last few years.  The Mark II adds noticeable image quality over the regular 5D.  I have the old 5D chassis and still use it, and once I have gotten used to the newer unit's LCD display, the old 5D looks small and cramped.  HD video, but I don't use the feature that much.  The live view is probably a function that most professionals won't use, but it's fun to play with.  I feel like it might be negatively affecting the sensor to keep it open that long, especially with my expensive glass.",
    "Comments": "It's expensive, but trust me, if you are looking at a prosumer body in the 1200-1600 dollar range, you might want to wait and get this baby.  The full frame will give you a lot of options that the midsize prosumers won't, and the image quaility is amazing without being too noisy (which might have been a problem at 22MP).  Newegg rocks as always.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Pretty amazing piece of hardware",
    "Rating": 5,
    "PublishDate": "12/29/2009 11:19:20 PM",
    "LoginNickName": "Mike Minor",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "* Specific video modes aren't straight forward enough. but then again this is a camera...\n* I'll try to find more and get back to you.",
    "Pros": "* Great menu, Canon thought this out well\n* Lens that comes with the bundle is phenomenal\n* Video is superb, will support 60fps soon\n* High ISO settings are ridiculous in a good way. Yes, shooting 6400 iso will make grain, about the same amount of grain my 30D has at 1500.\n* Full frame!\n* VERY solid build\n* Metal Body",
    "Comments": "* If you have the hard drive space, ALWAYS shoot RAW format.\n* If you don't have other lenses and looking to see this camera do amazing shots, grab the Canon 50mm for around $120. This camera combined with that lens at 1.8F and you will be blown away.\n\nThis camera really does break the barriers down for any photographer that has to shoot without a perfect setup. Yes, you could buy something cheaper and invest in flashes, etc... But at the end of the day you will realize with this camera it's really great to have something that doesn't need superb lighting for superb shots.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great purchase",
    "Rating": 5,
    "PublishDate": "8/29/2009 2:51:02 PM",
    "LoginNickName": "kumkax",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "none so far",
    "Pros": "-full frame (this is the primary reason I have purchased this camera), -easy menu (my previous camera was Nikon brand), \n-beautiful picture quality\n-with high ISO pictures sill comes out just amazing \n-and much much more.",
    "Comments": "Well worth spend money on my SLR upgrade.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]