[
  {
    "Title": "great little camera. Highly recommend it",
    "Rating": 5,
    "PublishDate": "11/12/2007 6:34:03 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Screen is kind of poor resolution. It always tricks me when i look at a picture i just took. It looks slightly grainy/blurry on the screen. However, when you zoom in, you can see that it took a good pic.  Its a small thing... doesnt effect the overall quality of the picture, so i've got no issues on it.",
    "Pros": "very nice. Takes great pictures. Fast start up, which is nice when you see something funny happening. Buttons are easy to use and are in good places. Not hard to figure out at all. I dont really bother w/ the best shot modes, but its got alot of them.",
    "Comments": "looks great! you'll get alot of compliments on it. Very reliable for me, and i've owned it for about 7 months. At 3/4 of an inch thick, its plenty small enough to fit in your pocket too, which is a big reason i bought this one. I really havnt had much of a problem w/ it turning on in my pocket either, which is nice. I would highly suggest this camera.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "ONLY LASTED TWO MONTHS",
    "Rating": 4,
    "PublishDate": "11/11/2007 5:02:35 PM",
    "LoginNickName": "wonderer",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Only lasted two months",
    "Pros": "Works great, great pictures, easy to use...",
    "Comments": "Will start a process of trying to get it fixed or replaced... I'm wondering how that's going to roll, since I didn't buy the extended...",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Nice Camera",
    "Rating": 4,
    "PublishDate": "10/21/2007 4:25:40 PM",
    "LoginNickName": "catdad",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "It's a bit small for my hands, but manageable. The included USB cable is proprietary, so you can't use a standard one to connect to a computer. It is also fairly short.  The USB cable connects in the bottom of the camera, so the camera must be laying down while connected to your computer.  I specifically got it for a 2700 mile road trip and was disappointed that it stopped working with the lens stuck in the extended position a few hours into the first day.  However, after removing the battery and turning it on and off a couple of times, it reset itself and started working again.  It worked flawlessly the rest of the trip.",
    "Pros": "My first digital camera, so coming from a novice, it seems to be fairly easy to use. The controls are mostly intuitive. Battery life is great. LCD is adequately bright. Anti-shake feature is great for taking pictures in wind or while riding in a vehicle. I'm happy with the pictures and others have complimented the quality.",
    "Comments": "I would probably give it 5 stars if not for that concern about the lens getting stuck again. It seems to be a great little camera otherwise.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 1,
    "PublishDate": "10/2/2007 10:07:09 AM",
    "LoginNickName": "Joemolf",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "LCD failed after one week of ownership",
    "Pros": "Camera took nice pictures",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "All-Around Awesome",
    "Rating": 5,
    "PublishDate": "8/28/2007 8:38:44 AM",
    "LoginNickName": "John Craig",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "• Reviewing/Deleting Photos feels slightly cumbersome.\n• I haven't found a \"Macro\" mode yet (may or may-not have)",
    "Pros": "• Very Compact\n• \"Easy-Mode\" for the beginers\n• Big View Screen\n• Excellent Quality Photos!\n• Great battery life.",
    "Comments": "I bought this for my girlfriend as an early birthday present when we went on vacation. It's very compact/portable and she carried everywhere in her purse. We never really \"had\" to charge the battery the entire week vacation. I put it in \"Easy-Mode\" for her and you simply point/shoot everything. I like it much better than my old Sony Cyber-Shot. Very high-qual. photos at 7.2MP and yet it's still fast to read/write the SD card. Also, fast loading onto the laptop via USB.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "No complaints!",
    "Rating": 5,
    "PublishDate": "8/26/2007 10:01:34 AM",
    "LoginNickName": "Kel",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Don't see any",
    "Pros": "Good image quality; ability to alter shot selection (black/white, retro, nighttime, fireworks, etc); slim design fits right into my shirt pocket. I love this camera and am so glad I got it at such a deal from Newegg!",
    "Comments": "Not like I really have to comment on the shipping of Newegg BUT I ordered on a wed and I had the camera in my hands by Friday. Thanx newegg!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "8/13/2007 4:09:40 PM",
    "LoginNickName": "JK",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Usb cable doesn't charge the camera. So after having it plugged in to the computer, I forget to turn it off and then the next day the battery is drained.",
    "Pros": "I'm not an expert, but the overall product is great. Shipped to me problem-free. New Egg is the best.",
    "Comments": "It seems that you could keep tacking on $25 infinitely per new or improved features... I really tried to draw the line at $200. You definitely get your money's worth.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "not a bad camera",
    "Rating": 4,
    "PublishDate": "8/9/2007 7:43:07 AM",
    "LoginNickName": "djbango",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Battery pack and the memory card are at the bottom of the camera, and the camera has to be off in order to change the card. Also the battery gets in the way during this process.\n\nThe flash is weak, and the indoor pics are a little dark. Also buttons are small",
    "Pros": "Very thin, and fast start up. Long battery life, and great outdoor pics. Large LCD dislay (though resolution is low, and looks washed out)\n\nEasy menu system.",
    "Comments": "I also have a Canon SD600, and this is my first non canon product (4 other Canon digital cameras), and I like it over all. there are some annoying things but nothing that would prevent me from buying the camera, especially for $169. Great for outdoors, and small enough to carry in your pocket all day, great point and shoot.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "8/9/2007 7:42:55 AM",
    "LoginNickName": "Py-Man",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None so far.",
    "Pros": "Fantastic picture quality. Awesome features. Outstanding video clips. Great deal. Can't beat the price anywhere!",
    "Comments": "Would definitely suggest this as a top purchase candidate.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Amazing",
    "Rating": 5,
    "PublishDate": "6/22/2007 11:51:45 AM",
    "LoginNickName": "Captain Obvious",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Not a good first digital camera for people that arent very \"tech-savvy\".  Buttons have several uses (because theres like 4).  So overall it's not the most user-friendly for people with not too much experience.  But if you have had a casio in the past you should have no problems.",
    "Pros": "AMAZING quality.  I know that there are much higher resolution cameras out there but this one gets the job done well....VERY well.  Amazing video quality.  Very sleek and thin.  Cool finish on the front.  3x Optical zoom works great.  Very high res images.  Simple design.",
    "Comments": "I have a 2gb card in this thing, holds about 450 images at full quality.  Each image at full quality is about 4.0MB (HUGE).  I LOVE this camera, I highly reccomend it.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]