[
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "1/18/2008 7:25:30 PM",
    "LoginNickName": "miked@mikedcc.net",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Did not come with a battery charger like the previous model.  Also did not come with a camera bag.",
    "Pros": "Great zoom.  Good controls for fine tuning the settings.",
    "Comments": "Used the Z612 and really like the camera.  Got this camera and ordered the accessories from the Kodak website.  The accessories came out cheaper than the retail or online stores I found.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Excellent Camera",
    "Rating": 5,
    "PublishDate": "1/10/2008 6:36:29 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Did not come with a rechargeable battery, the battery that is included in the package is just a high quality single use battery.  Once its dead, you gotta buy a new battery, or buy a rechargeable one.",
    "Pros": "Super sharp pictures, lots of features, great zoom, absolutely superb quality in any light settings. Probably the best SLR-Like camera's you can buy for this price, or even a little more.",
    "Comments": "This camera is an excellent camera and I would highly recommend it to anyone looking for an above average camera.  It may be a little larger (SLR-Like) than a regular slim camera, but the quality of the pictures and the extra zoom is well worth it in my opinion.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Amazing Camera for the price but..",
    "Rating": 4,
    "PublishDate": "12/28/2007 9:34:12 PM",
    "LoginNickName": "just passing by",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "I gave this camera the 4 stars.\nKodak is pretty bad about including any necessary accessories such as an AC adapter and a rechargeable battery. Why AC adapter? By using it, you can try to learn all the functions all night long without wasting a battery or two. BTW, the battery included in the box looks like rechargeable but it is NOT!! I also bought a compatible dock kit by Kodak. It includes a rechargeable battery but be aware..the battery included in the Kodak Dock kit is NOT compatible with Z712 IS camera though the box says the \"KIT\" is compatible with the Z series. I have talked to a Kodak CS rep and he told me the battery is included as a free gift and you have to buy the compatible battery, $29.99 at the Kodak Online store or $42.99 at the BXXX XXX..why? He said the box meant to say only the dock station is compatible with Z712 IS. I mostly use the Photoshop just to edit pics and noticed some noises in ISO 400. The 800 and 1600 on this camera are totally useless to me.",
    "Pros": "The camera features Schneider-Kreuznach lens and 12X optical Zoom. It can use 2AA, a rechargeable battery or the type of battery included in a box. You can manually adjust almost everything in your way when shooting photos. You can also shoot any moving objects/people. My son plays ice hockey and I was  finally able to catch up with his movements with this camera. Two burst modes let you take up to 6 continuous pictures or up to 30 pictures and let you save the last 6. The ISO settings are Auto, 64, 100, 200, 400, 800 and 1600.",
    "Comments": "No AC Adapter or rechargeable battery included with the camera. The Dock Kit with not compatible battery for $49.99. The rechargeable battery is as low as $29.99. I figured this out at a store, but very confusing product info for any newbies. $217.99 @ Newegg for now plus, if you want, buy the dock station, rechargeable battery and AC adapter for $$$.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Excellent All-Around Camera",
    "Rating": 5,
    "PublishDate": "12/27/2007 7:54:58 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "* Haven't found any",
    "Pros": "* Schneider-KREUZNACH lens\n* Optical Image Stabilization\n* Intuitive controls and menus\n* Can use 2-AA batteries\n* Wonderful picture quality\n* 30-fps video with sound",
    "Comments": "I used to sell digital cameras for a large, national retailer and during my time there I was able to use (and teach others how to use) the many brands we sold.  What I soon realized was that the Kodak line of cameras, though moderately priced, took pictures that were on par with cameras that were more expensive and were a heck of a lot easier to use.  I kept this in mind when I went shopping for a digital camera.  I wanted a good quality lens with lots of zoom (not the standard 3x), image stabilization, the capability to use AA batteries and have manual or automatic modes.  The Z712-IS is an amazing camera that not only met my requirements but exceeded them, with its many features.  I have received many compliments about the quality of the pictures and the level of detail and sharpness...I really can't think of anything bad to say about the camera after six months of use!",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]