[
  {
    "Title": "Good low-light performance",
    "Rating": 5,
    "PublishDate": "1/30/2014 8:30:00 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "It can be clumsy to activate some of the few manual controls the camera grants the user. I would have liked to see a HDR mode on the camera. Zoom is pretty loud when recording video - very distracting. Wifi access was kind of annoying to set up, so I haven't bothered with it.",
    "Pros": "Excellent low-light performance for the cost. Features, for cost, are pretty good. Auto mode selection is pretty intelligent. I've rarely had it mis-judge a scene to the point where it did something horrible with the image. Video is of good quality. Time to first shot is good. Battery life was very useable, and it's cool that it uses the same form-factor battery as some of my previous cameras. Even though I have my smartphone with me when I travel, it's still enough of a quality bump that I'd prefer to use the Canon.",
    "Comments": "I thought that the \"digest\" movie was a pretty cheesy feature at first, but after I got back from an extended trip overseas with it on, I actually kind of liked the feature. (It records time during auto-focus leading up to your actual shot.) It had taken little snippets of my trip that I hadn't intentionally documented. Some of these little windows into my trip were kind of endearing, but you could just as easily end up with unintended subject matter!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "ELPH 330 HS Review",
    "Rating": 3,
    "PublishDate": "12/26/2013 12:25:25 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The instructions to configure the wi-fi are lacking in key information, tell you  to press wrong buttons, and provide no instructions at all on how to upload pictures from the camera to your PC.  I have never seen worse instructions for any product! Canon website support did not help at all. I eventually figured it out!",
    "Pros": "Good camera, takes quality pictures, and all features work as advertised.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "ELPH 330 HS Review",
    "Rating": 1,
    "PublishDate": "12/24/2013 11:32:30 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The main reason I bought this camera is because it is supposed to have Wi-Fi. It is falsely advertised as having \"Built in Wi-Fi® allows you to wirelessly transfer your images to a PC\". Registration is required but is available to US citizens only! This is not stated! It will be getting returned to Newegg!",
    "Pros": "Takes quality pictures!",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "12/22/2013 8:55:15 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None",
    "Pros": "Easy, simple, intuitive.\nSame format as previous 5 canon compact cameras.\nGood processing speed.\nNeed to try the WiFi",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]