[
  {
    "Title": "Sick Camera!!!",
    "Rating": 5,
    "PublishDate": "12/15/2006 12:01:18 AM",
    "LoginNickName": "Mooch",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "On board memory is 16Mb. Need to buy add-on. Recommend 2Gb card that will give u that capability to for 1000+ photos. \nLens cover is fragile and could cause problems.",
    "Pros": "Can't beat the versitily of this camera! Amazing size for a 10x optical zoom. 3x doesn't even cut it anymore. LCD screen is big and with high detail. Plus easy to use straight out of the box. Long Battery life as long as you give it a good first charge. It also has bluetooth capabilities for wireless picture xfers. Great innovative product from Kodak.",
    "Comments": "Camera broke while playing football. Kodak replaced free of charge. Great customer service!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "One Fine Camera",
    "Rating": 5,
    "PublishDate": "6/20/2006 8:10:48 PM",
    "LoginNickName": "New Digi Cam Guy",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "There are too many ++pluses++ to let the few \"cons\" spoil the camera.  Here are my mild concerns:\n\n1. Not the longest lasting battery.\n\nKodak specs 135 pictures before needing a recharge.  That may be true if you are taking the pictures and NOT viewing them on the spacious viewing screen.  If so, and if you use the \"touch up\" feature to make your excellent photos even nicer, - well, you will sacrifice battery life.\n\nMake sure you take your charger with you when you travel!\n\n2.  Custom camera interface.\nThe V610's interface is a \"non\" USB standard.  The box is supposed to come with a V610 to USB adapter to allow you to mate up with USB cables to a PC or to the video input of a TV.\n\nMy \"new\" box was missing this crucial adapter.  Kodak was responsive enough to correct the error and send me the $8 adapter free of charge.\n\nOverall, both complaints are trivial, but the short battery life can be annoying if you are not prepared.",
    "Pros": "Simply stated, this camera is fabulous!  It is small, the pictures are fantastic and best of all, it has 10X optical zoom!  The 10X optical zoom frees you up to take really spectacular photos from long distances.  During my business trip to Northern California I was lucky enough to make time to explore the beautiful natural surroundings.\n\nI am fortunate I had my new Kodak V610.  I was able to take some magnificent photos of the CA shoreline, definitely utilizing the 10X feature.\n\nPluses:\n\n1. Small\n2. Lightweight\n3. Easy To Use\n4. Large Viewing Screen\n5. 10X Optical!!!! (worth it!)\n6. Easy to use \"panoramic\" shots\n\nThis camera is fun to use.  I enjoy the clarity of the photos.  I'll never go back to a 3X digital camera again!",
    "Comments": "Great camera.\nGreat pictures.\nWorth the purchase!",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]