[
  {
    "Title": "Excellent camera for the money",
    "Rating": 5,
    "PublishDate": "8/22/2008 9:40:15 AM",
    "LoginNickName": "Ravenhawk82",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Often overexposes, but this can be corrected with a -.3 or -.7 exposure compensation. Might need more in low light, but that's your call. Also, the lens vignettes a little (has darker corners), but it's not really noticeable unless you're shooting the sky or a blank wall.",
    "Pros": "Perfect for everything I do. Tinker with a couple of settings and you can get awesome colors from normally boring subjects. This particular lens is also great for the price. 18-135mm is often more than enough wide angle and zoom. Go for an 18-200mmVR if you can afford it, but this makes a great solution for a do-all lens if you can't. \nI would recommend this camera to anyone. I use it almost daily, and it has given me excellent results. I use it along with the lens included here, a 70-300mmVR, and a 50mm f/1.8. I would also recommend these lenses to anyone interested in expanding their range without spending your life savings.",
    "Comments": "Not a con, but just something that should be noted. This camera can not meter with any non-AF lenses.  This means any lens that is not able to auto-focus MUST be shot in Manual mode, or the shutter will not open. This isn't a problem if you plan on just buying new lenses and not using pre-AF, but should be noted if you do, or want to get a Lensbaby. For a workaround, just take the picture, see how it looks, and adjust the shutter speed accordingly. \nDepending on what you shoot, you might be able to get away with a D40/D40x/D60 and spend more cash on the lens (lenses impact image quality more than cameras), but it's up to you.\nAs I said before, I'd recommend a 70-300mmVR for a midrange-priced (but high quality) zoom, and a 50mm for things like portraits and anything low-light. Both of them together can normally be had for less that an 18-200mm.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Extraordinary",
    "Rating": 5,
    "PublishDate": "5/10/2007 10:00:41 PM",
    "LoginNickName": "BurstingBlack.",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None what-so-ever.",
    "Pros": "This camera is simply amazing.  I've been using this for my graphic design business taking my own stock photos, as well as photos for clients, merchandise, people, landscapes, and more.  This camera has preformed flawlessly.  Very easy to use out of the box.  Manual settings are incredible.  Low light is good.  High ISO speeds.  30/sec exposures for night come out amazing.  Detail is crisp and clean.  18-135mm Kit Lens is excellent.  LCD is 2.5\" very nice!  When croping pictures, the 10.2 MP is short of amazing. 3 pics/second burst shooting. I could go on and on and on and on...",
    "Comments": "Get a fast SD Card (133x) for faster writing speeds.  I also go the battery grip for extra grip and one more battery...worth the extra cash.  I've taken over 800 pics and still have 50% battery life.  You can keep the camera on and just wait for the perfect moment.  If you are thinking of a DSLR, this is the one to get under $1500...",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "D80 rocks",
    "Rating": 5,
    "PublishDate": "5/8/2007 4:35:29 PM",
    "LoginNickName": "Derek",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None at this time...  Of course we always wish it costs less but you do get what you pay for...",
    "Pros": "Camera's quality and ease of use is a 10, ability to control everything you need is superb as well as the lense included is amazing. You will not be disappointed.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]