[
  {
    "Title": "Casio",
    "Rating": 5,
    "PublishDate": "9/2/2007 10:07:22 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The only con I have so far is that the battery came defective, the charger wouldn't charge it, but once i got a new one it worked great.",
    "Pros": "So far great camera, got it as a gift for my mom, she loves it, VERY thin which for me makes the camera, nice big LCD and at 7.2 MP for the price you can't beat it",
    "Comments": "Great camera but hopefully your battery doesn't come defective!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera for price",
    "Rating": 5,
    "PublishDate": "8/23/2007 4:29:32 PM",
    "LoginNickName": "Vongo",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Can be hard for people with large fingers. No optical viewfinder.",
    "Pros": "This is a great camera for the price.  I got tired of having blurry pictures so I wanted a small pocket camera with image stabilization.  Takes great pics. Make sure to get a large SD card. Turns on and takes pictures quickly.",
    "Comments": "Newegg delivered as ordered!  Good job.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "8/4/2007 1:05:32 AM",
    "LoginNickName": "Planefreak",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "There are very few.  One is Easy Mode which can be turned off.  Another is the low optical zoom but what do you expect from such a small camera.",
    "Pros": "Got this camera about a month ago.  I was suprised from the moment I took it out of box.  Great brushed finished, compact size, and bright lcd screen were very appealing.  It has a good quality and resoultion picture compared to its size.  It also has a very quick shutter speed and also turns on very quickly.",
    "Comments": "Good interface, and simple design.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]