[
  {
    "Title": "Shipping Incomplete",
    "Rating": 3,
    "PublishDate": "12/24/2007 11:52:46 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Unfortunatly the Delivery was Incomplete.\n\nThe Online Shop promised:\n\nFree 1GB SD card & camera case w/ bundle, ends 12/31\n\nbut it came without SD - Card and Case.\n\nWhen can i expect the missing items?",
    "Pros": "camera has been delivered",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "What an impressive little camera!",
    "Rating": 5,
    "PublishDate": "12/21/2007 10:19:21 PM",
    "LoginNickName": "linden77",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None for me.",
    "Pros": "Wide angle AND 10X optical zoom AND optical stabilization.  Great smmoth video.  Only a little bigger than small pocket cameras and well worth the extra size.  Had this been out would have bought it instead of the other two cameras I own.  If you don't think of Panasonic as a top tier camera manufacturer, buy this camera and you will change your mind.  Nice big LCD screen, too.",
    "Comments": "Have sold several other persons on this camera after they looked at mine.  Little bigger than real pocket cameras, but not by much and can take amazing pictures and videos.  Lots of preset setting for point and shoot.  Not so much for manual controls, but that's not what it's for.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "12/9/2007 7:05:23 PM",
    "LoginNickName": "Lan",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Lack of manual control could be a sticking point for some.",
    "Pros": "Great camera for the price. Lens is crisp and the clarity of the screen is perfect. Anti shake function works well.",
    "Comments": "Bought this for my parents to replace an old 3Mp they had so lack of manual control was actually a good thing as they would have never used it. Having worked in the camera department for a number of years i was surprised by this camera especially after getting it a 2Gb card and extra battery for under 300",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "great card",
    "Rating": 5,
    "PublishDate": "12/2/2007 9:55:39 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "the digital zoom just crops the pictures, it does not actually zoom anymore.  I guess that is fine, but i could do it with my computer too.",
    "Pros": "perfect for what it is.  It is a point and shoot camera and its amazing at that.  I took it to a party and took a bunch of pictures to see how well it would do.  It has far surpassed my expectations.\n\nI tried all the modes, and simple mode seemed to be just as good as all the others.  the wide angle is great",
    "Comments": "its 295 now?   i bought it for 229 with free ship on 11/27.\n\nGot the adata 4gb sdhc card and a couple spare batteries from oldbay* (*replace old with E) for 20bucks and I'm ready for battle.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "12/1/2007 12:11:19 PM",
    "LoginNickName": "gw",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "none",
    "Pros": "for my son for xmas",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera; beware when choosing a memory card!",
    "Rating": 4,
    "PublishDate": "11/9/2007 5:42:39 AM",
    "LoginNickName": "StarryNight",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Confusion over SD vs. SDHC memory cards.",
    "Pros": "Great camera! No complaints but one...",
    "Comments": "Everything good that others have said about this camera, ditto! The camera rocks!\n\nI'm writing this review to help anyone who buys this camera to choose the right memory card. I'm an amateur photographer and this is only the second digital camera I've owned. Here's my story.\n\nI bought a 4GB SD card to use with this camera, and found out that it's not compatible. \n\nThis camera can use a memory card up to 4GB in capacity.  HOWEVER, any card larger than 2GB must be a SDHC card rather than a plain old SD card. I found this out only after ordering a 4GB SD card for my new camera and finding that it would not work. I got into the user's manual and found out that if I wanted to use a 4GB card, it had to be SDHC instead of SD. \n\nI haven't tried to use a smaller size card, but the manual says that any card 2GB or under can be SD. If you're buying this camera, please make sure that you get the right card with it. I had to pay a restocking fee for buying the wrong card.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "downsizing as a good thing",
    "Rating": 5,
    "PublishDate": "9/26/2007 3:38:13 PM",
    "LoginNickName": "simon",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "lighter in some of the manual modes but can be compensated for through plentiful supply of scene modes, mic is weak in movie mode and more suited for adding commentary, definitely buy a screen guard, some shots can be overexposed but it's clear in the viewfinder and the exposure button is right there.",
    "Pros": "huge screen, no more lens swapping, real movie mode, tons of scene modes, quick to start, focus and turn off, compositional grids to reduce those crooked shots, image stabilizer to further reduce out of focus shots, sd card goes right into my wii (no sdhc) for slideshows.",
    "Comments": "as an upgrade from a nikon 995, this camera proves to me the advances made to the digital imaging industry over the past several years and it actually fits in a pocket.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great \"All-in-one\" Camera",
    "Rating": 5,
    "PublishDate": "7/16/2007 8:06:10 PM",
    "LoginNickName": "Jeff",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "LCD needs screen protector. Vivid mode has a bit too much noise.",
    "Pros": "Lots of great features packed into one camera: 10x optical zoom, 28mm wide angle lens, and 3\" LCD.",
    "Comments": "This camera's \"fun factor\" is off the scale compared to other cameras in its class. It's great to take anywhere. It's best to use 'Standard' picture mode. Natural is too soft and Vivid has too much noise. Standard is just right. \nI liked this Panasonic so much that I just ordered its less expensive little brother, the LZ7, which has a 9x optical zoom (but wide angle) as a camera to carry with me to work everyday.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great all around camera",
    "Rating": 5,
    "PublishDate": "6/30/2007 8:11:41 AM",
    "LoginNickName": "lancemr2",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "No manual focus.",
    "Pros": "Great wide zoom.  Very easy to get to most needed features. Buttons in the right places. Great movie mode. 3\" LCD screen makes a HUGE difference. SDHC support... get a very high capacity card and never have to swap cards.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Love the zoom",
    "Rating": 5,
    "PublishDate": "6/26/2007 10:50:53 AM",
    "LoginNickName": "JWJOE",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "not so great in poor lighting conditions, the screen is easily scratched",
    "Pros": "great zoom, easy to use, great for the money",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]