[
  {
    "Title": "Lens is nothing exceptional",
    "Rating": 3,
    "PublishDate": "8/5/2012 12:08:59 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The 18-135 mm STM lens does not provide high image quality. This was expected, despite the hype and $550 price. In fact, images are comparable, and sometimes worse, than images taken with old Canon EF-S 18-55 AF lens. Especially bad are images at F=35 mm, at all apertures (compared to old lens). Marginally better images are obtained at F=18 and F=50 mm. Increasing the zoom range twice had a negative effect on image quality.\n\nBattery life is less than one would expect, even though the battery is not small.\n\nUses an old sensor, likely from 2009.\n\nThere are a few bugs in flash's working. The flash tends to fire while switching settings on the camera.",
    "Pros": "Very comfortable camera to work with. Things are very logical.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "amazing camera - better with the 18-135 stm lens",
    "Rating": 5,
    "PublishDate": "7/31/2012 11:43:06 AM",
    "LoginNickName": "Steve-O",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "the stm lens is a bit slow, and not happy in low light. but the 25600 iso, f3.5 and a 1 second shutter will get you a 4pm shot at 2am. the grain is surprisingly minor - though VERY noticeable.\n\nthe audio recording is pretty bad still. the mics are better, but the preamps in the camera are not designed for GREAT quality.. only GOOD quality. pick up an external audio recorder to help with the audio.\n\nworks well with the new canon 600ex-rt speedlight, but it really should have a built in radio transmitter. It's been a decade... the pro's should have had it 8 years ago and it should be in consumer level cameras by now.\n\nthe lens weighs almost 2x as much as the camera\nthe strap stinks. grab a speed strap - they are worth it.\n\nsame body layout as previous models, so larger mounting plates - like a manfrotto hexagon - block the battery door.",
    "Pros": "touchscreen is SO much faster than the t3i\nhigher iso\ndifferent shutter mechanism than the t3i (T4i sounds just like the 60d, not cheap like the T3i. I think this is the biggest pro, and the main reason I was leaning to the 60d over the t3i... so glad I waited for the t4i!)\nstereo mic is actually not bad - big improvement over the t3i\nstm lens is amazing\nthe digic 5 sensor does seem to give better color and image quality / but it is only slightly better\nsame body style and layout as the t2i and t3i, so older battery grips and accessories with fit nicely.\n5fps and 20 shot burst at 18mp is nice. at lower res with a fast sdcard, you can shoot until the card is full.\nthis lens is so worth the extra money. shooting video without it is pointless.\n\nusing this to shoot - among other things - green screen with a teleprompter. The picture quality is amazing - and the progressive capture is a big step up from the interlaced of the prosumer camcorder I had been using.",
    "Comments": "Canon is going to the single pricing model, so the price is the price - regardless of the store.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]