[
  {
    "Title": "Incredible",
    "Rating": 5,
    "PublishDate": "1/14/2006 9:52:59 AM",
    "LoginNickName": "firebehindcrystal813",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "I haven't found any yet...heh.",
    "Pros": "This camera takes amazing pictures! I love it! The quality is so amazing for such a small and not so pricey camera. I have a 512 mb memory stick so I can take about 400 or more standard pictures or about 250 fine. Wow!",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 4,
    "PublishDate": "1/2/2006 12:45:39 PM",
    "LoginNickName": "bigswole",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Unfortunately I had to give this camera less than perfect even though it's not the cameras fault. NO oem memory card included. Not even and small 16mb one. Very unprofessional and not cool. Thank goodness I have a palm pilot and was able to take my memory card out of that for x-mas morning.",
    "Pros": "The LCD is crystal clear, easy to understand navigation, bought as an x-mas present and arrived on time as usual. For the price and name brand, great camera. 4mp is plenty for average usage.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Very Good Buy",
    "Rating": 5,
    "PublishDate": "12/7/2005 8:55:21 AM",
    "LoginNickName": "SevenT",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The only con is that the screen is pretty small, but since even the largest screens are not really any good for viewing, I don't find it a problem. It is more than adequate to check exposure and composition. And you can zoom into any section of the picture to check focus. I don't find it much of a negative at all, but potential buyers should be aware of this one slight drawback.",
    "Pros": "I have been taking photos since the '60's and have been using digital cameras since 1997 and currently own a high end Nikon D70 DSLR. But I needed a camera my wife could operate with little or no fuss. This works perfectly. It is true point and shoot for the beginner, but has the capability for user settings when/if the user advances that far.\n\nIt is not subminiature, but is quite small enough to drop into a pocket, and easily into a purse.\n\nOne big advantage is that it has a focusing light for lowlight pictures. Quite a few cameras in this class do not have that, and it is essential unless you never shoot in low light. This ensures your low light pictures are always properly in focus.",
    "Comments": "Overall, one of the best bang's for your buck. the 4 megapixel size is more than enough for the avergae user and will easily print excellent photos at 5x7.\nYou do need to get a memory stick as well since the internal 30mb is nowhere near enough for normal use. I would suggest at least a 256mb stick, and perhaps a 2nd one later if you find you take lots of pictures.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Product. EXCELLENT SERVICE!",
    "Rating": 5,
    "PublishDate": "11/28/2005 3:01:17 PM",
    "LoginNickName": "Immortal",
    "BoughtTimeTypeString": "",
    "TechLevelTypeString": "",
    "IsNewReview": false,
    "PurchaseMark": false,
    "Cons": "",
    "Pros": "",
    "Comments": "Just ordered this camera as a Christmas present for my daughter, based on previous experience with my own Sony digital camera. As always, Newegg got the order here in record time, even over Thanksgiving weekend... 3 days before it was scheduled.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Good Camera",
    "Rating": 5,
    "PublishDate": "10/20/2005 5:17:46 PM",
    "LoginNickName": "WAHCHING",
    "BoughtTimeTypeString": "",
    "TechLevelTypeString": "",
    "IsNewReview": false,
    "PurchaseMark": true,
    "Cons": "",
    "Pros": "",
    "Comments": "Good Camera if your on a budget, a 4MP will do in any case.  \n\nShipped was fast, Shipped it in 2 days thank you newegg, didt like UPS though since they just left it there.  \n\nBut overall its a good camera. Plus you need to buy a memory stick i.e. 512-1gig will do and some rechargable batt's.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "10/19/2005 8:55:51 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "",
    "TechLevelTypeString": "",
    "IsNewReview": false,
    "PurchaseMark": false,
    "Cons": "",
    "Pros": "",
    "Comments": "Good camera for those on a budget. Battery life is nice but i recommend getting recharbles. the batteries that came with the camera were dead in a few days, but two rechareables have lasted for almost 2 months. Takes good pics, internal memory is nice, video quality is decent, so all-in-all its a good budget camera.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "7/12/2005 5:16:01 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "",
    "TechLevelTypeString": "",
    "IsNewReview": false,
    "PurchaseMark": true,
    "Cons": "",
    "Pros": "",
    "Comments": "awesome camera, takes great pictures and decent video too. the screen is a little small but i can still see the photos i take easily. It isnt the smallest camera but it can still fit in my pockets easily. comes with a usb thing for your comp, makes it very easy and only takes seconds to put the pictures you have taken from your camera to your computer.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great compact camera!",
    "Rating": 5,
    "PublishDate": "6/8/2005 9:21:20 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "",
    "TechLevelTypeString": "",
    "IsNewReview": false,
    "PurchaseMark": true,
    "Cons": "",
    "Pros": "",
    "Comments": "I bought this for my wife and daughter. The Sony DSC-S40 is a great compact camera that is very easy to use and compact. There is even a dedicated button on the back to select image size.Though not quite a slim as the slimist it fits easily in purses and pockets and is comfortable to use and handle. The LCD is a little on the smaller side but adequate. It takes great pictures, only needs two AA batteries, and has a built in auto lens cover which is big deal with the way my daughter handles a camera! I look at the sighty more expensive super slim Sony but did not like the fact that it used a special rechargeable battery. I wanted to have a camera that uses AA's that you can find anywhere and have spares ready to go. Battery life is decent even with only two batteries. There are a lot of comaparable cameras in this price range but I am very happy picking this one and would buy it again. Sony memory sticks have become priced competitively these days and perform very well. I use a Sandisk memory card reader to a USB 2.0 port for my digital cameras instead of using USB cable. That was also money well spent.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]