[
  {
    "Title": "Good enough!",
    "Rating": 5,
    "PublishDate": "4/3/2010 2:07:02 PM",
    "LoginNickName": "Mr",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None for my purposes. I shopped elsewhere, because Newegg is just now marketing the LX-3.",
    "Pros": "Leica Summicron optics, excellant wide angle capability, and terrific menu varieties. Manual controls, and the ability to  add a Leica spotting scope if you want some extreme high-quality zoom; 2000-3000 mm if  your feet are too-sore for letting your walking do the zoom. The smaller size is a huge plus from bulky dslr's. Leica optics can attract any image faster than  other makers of optics, regardless of the aperature used. Panasonic makes Leica optics affordable. After 40 years,  I am finally able  to get off the Nikon/Cannon bandwagon.",
    "Comments": "Add a flash bracket with over 150 ft. of dedicated flash capability, and you have got any indoor photography well covered. You would also have second-curtain functions at  your desposal. Bumb the IS0 up at bit, and the onboard flash will do the job just fine using second-curtain. And then only if movement is a problem; otherwise use  a good tripod.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Outstanding compact for demanding users",
    "Rating": 5,
    "PublishDate": "2/19/2010 7:04:53 AM",
    "LoginNickName": "J",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "While very small, the camera is still not really pocketable. The adapter tube for filters adds considerable bulk. The lack of an optical viewfinder exacerbates battery life issues, and the accessory viewfinder is absurdly expensive. Manual controls are a bit awkward. The optical zoom is limited, so you you find yourself making much use of a long zoom this might not be the right choice for you.",
    "Pros": "What great glass; the sharp, f/2 fast, 24mm wide lens is a standout at any size and true stunner on a compact. Smart features like user-settable auto-ISO limits, live historgrams, and aperture priority mode shooting make this a true photographers compact, but it still works great as a pure fully-automatic point-and-shoot. RAW capture, manual control, and outstanding build quality compete the package.",
    "Comments": "On the whole, this camera is exactly what I'd hoped it would be: a very capable compact that I can get great results with when taking my SLR along is impractical. The fact that it does this, and still does great in the hands of my non-photographer wife, makes this camera an utter winner. Like any compact save perhaps the Sigma DP series, noise above ISO 400 is, at least to my eyes, unacceptable. But at lower ISOs the results are excellent, and the f/2 lens and very capable vibration reduction allows you to keep the ISO down even in low light. Battery life is good but not great, though with an optical viewfinder and the display set to power off after a few seconds this is much less of an issue (I use one from my Voigtlander Besssa-L, the Panasonic one costs a fortune). The build quality and firmware is every bit as good as you'd expect from the Lumix line. If you are looking for a compact that allows very good creative control without trading much compactness, you have found it.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Lumix LX3",
    "Rating": 4,
    "PublishDate": "1/26/2010 4:20:44 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "This is not a con so much as a feature request: The only thing keeping this camera from a 5 star rating is the short optical zoom. Here's hoping the LX4 bumps it up to 5x of so. Like any P&S, in bright snowy conditions, its hard to see the screen controls (particularly if you wear polarized sun glasses). Like any small camera, its almost impossible to shoot with gloves on ... even thin liner gloves -  the buttons are just too small when conditions are cold. Have not shoot any video with this camera so can't say much about that.",
    "Pros": "This is a great camera period. Any small camera takes a while to get used to, so don't be so quick to judge this one. I use it in the mountains and on building job sites. Great depth of field with fast F2.0 24mm lens, excellent LCD screen, good white balance, decent flash, LOTS of manual controls, good battery life, and good OS features.",
    "Comments": "The CCD's on these little cameras are what they are - too small. So, you have to expose for the brights and process for the darks. If you point and shoot without taking this into account, any P&S camera will consistently over expose a high contrast scene.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]