[
  {
    "Title": "Great for College Student",
    "Rating": 5,
    "PublishDate": "12/29/2008 10:58:42 AM",
    "LoginNickName": "Wilbar",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "If any battery don't last very long depending on what type---I highly recommended spending few extra bucks for the newer energizer Titanium or Lithium or even few rechargeable Ni-MH seem last a lot longer then standard alkaline",
    "Pros": "Great picture quality for the price, Digital Zoom feature, some manual settings--- idea for college student to take your average pictures all around and isn't very expensive",
    "Comments": "Was great X-mas present",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Samsung S860",
    "Rating": 3,
    "PublishDate": "12/16/2008 1:57:16 PM",
    "LoginNickName": "Johnny_472",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Consumes alkaline batteries. Averaged 6 pictures per set of batteries when shooting with flash and using zoom along with review of pictures, not much better during other conditions. Nicads improved battery life greatly. There was no warning that the battery was low as screen showed full battery bar but would shut down and fail to turn back on. VERY SLOW time between taking a picture and the ability to shoot again as camera stores picture to card. Seemed like seconds when wanting to take second shot right away. Top function button is very easily moved when removing unit from belt type carrying case causing you to shoot under wrong mode. Happened  many times.  Camera wrote several pictures to SD card with errors causing you to lose image.",
    "Pros": "Unit takes excellent pictures, uses standard AA type batteries, standard type SDHC card. Nice size and viewable display screen. Multiple shooting modes. Zoom and \"anti-shake\" function excellent. Has good facial detection.",
    "Comments": "For the price it is a good second camera or a childs camera but if your serious about taking pictures buy something else. I will probably keep this camera in my glove box or take on trips where I don't reallly care if the camera gets damaged or lost. Personally like the ability to crop previous pictures from zoom and arrow controls and resave changes under new image file.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "NICE",
    "Rating": 4,
    "PublishDate": "11/5/2008 9:01:45 PM",
    "LoginNickName": "shugwil",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "no zoom in movie mode.",
    "Pros": "picture quality, manual modes, digital zoom, small and but yet powerful.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "not",
    "Rating": 4,
    "PublishDate": "10/30/2008 9:49:42 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "case feels empty in some areas, like there is wasted space inside. self-portrait audio feedback is lackluster (still a good feature though). video resolution could be better. camera is slow to react sometimes (millisecond delays, but noticable). this camera is not ideal for shooting sports events because there is a short delay between pressing the shutter button and capturing the picture. it also takes about a half second to save photos at max resolution.\n\nbiggest con for me was the use of a non-standard usb port. it does not use a typical usb mini connector.",
    "Pros": "face detection, nice flash, takes plain old AA batteries and industry standard SD. camera also has built in memory. has on-the-fly shooting tutorials that walk you through the camera's features without having to open the manual at all. has a powerful flash built in as well as a sturdy standard-thread tripod mount. takes very nice pictures for a cheap point-and-shoot by a brand-name",
    "Comments": "wrist strap seemed a bit long for my taste, but it still saved my camera from drop damage three times already! mode selection wheel clicks into place bit too easily, but that's a matter of personal preference and not necessarily a con.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great pictures night or day!",
    "Rating": 5,
    "PublishDate": "10/30/2008 3:38:03 PM",
    "LoginNickName": "boomboom",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The camera build could have been a little better, but at this price it's not as important. After all samsung had to cut production cost somewhere).",
    "Pros": "Simple to use camera for nice quality photos. Quality is very good, reminds me of my Canon camera.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Good camera",
    "Rating": 5,
    "PublishDate": "5/23/2008 4:14:41 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat Low",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Without proper lighting your pictures may not be top notch. The lens rattles when extended completely out.",
    "Pros": "It has 8.1MP picture, face detection, digital image stabilization, and more. It seems to me that it takes very good outside pictures and also far inside pictures. I have already taken some great pictures with it. It takes good quality video.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]