[
  {
    "Title": "great while it lasted!",
    "Rating": 3,
    "PublishDate": "1/23/2013 10:13:02 AM",
    "LoginNickName": "lipomaman",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "battery no longer charges...don't know if it's the battery or the charger.  Also the \"on\" button is now finicky and takes 1- 10 presses to get the camera to turn on.",
    "Pros": "Great underwater photos and remarkably good photos above the water as well.  Good for low light situations.  Quick start up.",
    "Comments": "Didn't pay too much and it took awesome pictures for the entire 7 day Disney cruise which is what is was purchased for, so I can't complain too much.  I'd be happier if it still charged and worked like when it was new, though.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Inconsistant",
    "Rating": 2,
    "PublishDate": "1/18/2013 1:09:28 PM",
    "LoginNickName": "willnmina",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "I really, really wanted to keep this camera.  It has everything I wanted in a waterproof camera.  But when it comes down to it, what we all want is a good picture the first time we click the shutter.  I want good exposure and pictures that are in focus - unfortunately that's where the Pentax falls short.  I own 6 other digitals from Vivitar to Canon and without a doubt this camera is the most inconsistent I ever owned.  One great photo the next one completely blurry, one with great exposure one completely blown out with the flash.  Another one very grainy with tons of artifacts the one next fine. I understand this camera will not measure up to my Canon or Lumix in quality photos, after all it is an underwater camera with a fixed lens.  But I need to have a camera that I can count on to take good photos the first time.  I am sending it back to New Egg, too bad. I am off to try the Olympus TG-850.",
    "Pros": "Super price, great looks, lotsa' modes, easy to use, stylish, great accessories and packaging, almost everything you need in a camera. $",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Do not submerse",
    "Rating": 1,
    "PublishDate": "1/8/2013 9:03:05 AM",
    "LoginNickName": "nmh",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Fails when used in water. Took it into the ocean and noticed fogging both under the lens and viewfinder within minutes while snorkling. Over time the camera fogged completely and then shortly after the trip ceased to turn on any more, indicating water damage. The battery door on the bottom seems very loose and is probably the main location where the seal is poorly constructed. After handling a few more models in the store, I can see that this issue runs through this line. I would not buy this camera for use in a pool or ocean even just below the surface (despite the 30 ft rating).",
    "Pros": "Great image quality. Versatile. Rugged in regard to shock.",
    "Comments": "Wish Pentax would reimburse for the purchase. Do not buy if your intent is to use this in wet conditions.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Check screen for issues",
    "Rating": 3,
    "PublishDate": "12/24/2012 10:10:58 AM",
    "LoginNickName": "kauboy",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "First one had a vertical line in the images when certain settings were used, got RMA and the second one had a single dead pixel on the LCD. Didn't show on images so I didn't care, but it is why I gave the title above. The LCD will scratch easily so adding a protector film is advised. Lens can also scratch, just because it is \"rugged\" doesn't mean you can be careless.",
    "Pros": "Picture quality is great. Better pics with less blur than the wife's Fuji. Clip allows for quick attach to belt loop for easy carry and fast access. Smile detection and self-portrait assist are really nice and work well. Boot up is quick for impromptu shots. Retakes are reasonably quick with minor saving delay. Battery lasts a good while and charges quickly.",
    "Comments": "All in all, I'm happy with the camera. It does what I need and I don't have to baby it much. Pictures are nice, lots of settings to tweak or presets to use. On-camera editing and post-effects are helpful too. Feels very solid. The two panels housing the batt/sdcard and connector ports do wiggle a bit, but a closer inspection of the seals show why this isn't an issue in water resistance. Got this the first time it was offered for $150 and was very pleased. Would not pay $300 for it though.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Like it so far",
    "Rating": 4,
    "PublishDate": "10/5/2012 3:57:00 PM",
    "LoginNickName": "Sucker",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Menu system could be easier to use. Reviews on other sites complain of leaks ruining cameras. Night usage also a concern. I will update after some underwater use.",
    "Pros": "Size is nice and for easy carry. Initial pics are very nice and clear. Bought for a trip and should be just what we wanted. Macro works very well!",
    "Comments": "Got it on sale for $150. Shopped around and was best deal to be found.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]