[
  {
    "Title": "Good One",
    "Rating": 5,
    "PublishDate": "8/28/2013 1:54:39 PM",
    "LoginNickName": "Forgot",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "It is small and you might lose it, whereas a big DSLR is never to be lost in its big bag and all the lenses.\n\n  I really can't think of a reason to buy a big camera, unless you need to take professional pictures of highest possible quality, which most family pics are not.",
    "Pros": "This has the larger sensor than the run of the mill point and shoot Canons.  I have used my G9, which uses a similar sized sensor, for about four years and it is great for portraits and snapshots as well as panaramas.   \n\n  But I still carry my small point and shoot for family outings and keep the big one home.  \n\n  This is what I should have gotten, if I had known then what I know now, heh, and if they made them then, same ole story.\n\n  This also has a F 2 opening on the lens iris which many people love as it gives good low light photos without flash and lower noise.  Lets in more light.  Called being a \"FAST\" lens, cause it makes you use a faster shutter speed for the same amount of light.  F2 is pretty fast,  enough to not have to take flash in museums usually.\n\n  Those two items are worth the money right there, and it also has much more improvements over a regular small camera, like RAW pictures, which are what it sounds like, unprocessed, uncompressed data photos you can work on yourself rather than have the camera process.\n\n  Also it has the latest Digic 5 photo program to make little things better.\n\n  The larger the sensor, the better the picture.  There is less noise and better contrast and pop.  Wether this is is important enough to you to spend the extra money on is up to your budget.  But you do get a better picture from this camera than you would from a $150-$190 camera with a 1/3 inch sensor.\n\n  Just be aware the difference is slight and may not be noticed by all who view it.  But if you are debating whether or not to go with a large DSLR or a small point and shoot, this is a good inbetween.",
    "Comments": "It is a better camera than a regular point and shoot, but costs more and is worth more.  Just if you have the money to spend, I would recommend to friends.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Canon USA PowerShot S100",
    "Rating": 5,
    "PublishDate": "5/19/2013 12:43:55 PM",
    "LoginNickName": "petermonte",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "none for my needs",
    "Pros": "I bought it for two reasons: \n1.) AWESOME LOW LIGHT PHOTOGRAPHY\n2.) 1600 x 1200 Resolution pictures with high compression (low KB size images)\n3.) LONG BATTERY TIME\n\nIn simple words, I use camera for taking a lot of pictures and sending them through emails and for that I need small size picture but quite large resolution I require min. 1600 x 1200 and my max size is so far: 569KB min size: 102KB and average size: 260KB STILL SAME RESOLUTION: 1600 x 1200\nNow the very low light photos: I absolutely hate pictures done with flash so I am ABSOLUTELY A M A Z E D with pictures done in low-light, they look just as a human eye can see it. If someone would ever told me that this camera is capable of delivering such an images under such a circumstances I would not believe it, now I know it can\nBattery hold a charge for more than week (with a very frequent use of flash light) but obviously constant use of LCD \nI Truly am grateful, Thank You Canon",
    "Comments": "I don't know how long will this camera last, so far I own it for about 8-9 months and so far so good\nI do not need to use other camera futures",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Compact and capable point-and-shoot with a few tradeoffs..",
    "Rating": 4,
    "PublishDate": "9/16/2012 3:38:25 PM",
    "LoginNickName": "KenWP",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "HDR is worthless without a tripod. When so many other brands have HDR auto-alignment built into the camera.\nGPS auto-logging eats the battery; I'd rather use my phone for GPS logging and then use a program like Geosetter to sync.\n\nThis is written in other reviews, but the firmware's requirement for ISO80 for exposures over a few seconds is baseless and stupid. Makes it impossible to take any star pictures or any decent night-time picture. I hope they can tweak this in a future firmware update.",
    "Pros": "Light and compact, it's a decent take-along when you don't want the heft of a DSLR. Images are solid, RAW shooting is good; I don't feel like I'm losing everything from my DSLR. I like the super-fast burst mode if I ever have a good reason to use it, and the exposure bracketing makes up for a nearly useless HDR feature.\n\nGood color JPEGs, pretty quick turn-on-to-photo response.",
    "Comments": "I bought this as a lighter option for hiking/backpacking over my DSLR. RAW image capture was an essential feature and I compared this camera to other RAW-shooting point-and-shoots and it is the best value, though it acks the latest software features.  Again, having RAW enables me to do a lot in post-processing that the camera cannot do.\n\nOverall I think it will suffice; it's much lighter and compact, something I can attach to my backpack shoulder strap, which will encourage more picture-taking. \n\nThis is my fourth Canon point and shoot -- I am rough on cameras in my hiking in the Cascades, and my dog chewed my SX220IS. I bought this to last me for two seasons....",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera, a little flimsy though",
    "Rating": 4,
    "PublishDate": "6/16/2012 12:53:44 PM",
    "LoginNickName": "amiracle",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Pricey\nLCD broke with very little stress\nGPS is a battery hog",
    "Pros": "Great upgrade from the S90\nPlenty of great features (slow motion, tilt shift video / pictures) \nExcellent low light photography\nLarge LCD",
    "Comments": "I'm a huge fan of Canon photography and I wanted to like this camera, but ultimately I kept my S90 and returned this defective camera.  It was a great deal ($350 at the time) and I was able to take some great pictures with it.  Overall though, it was a bit pricey to upgrade from the S90 to this one.  Plus, the LCD broke less than a weeks worth of use; my S90 is going on two years and still working great.  \n\nIf you don't already own a great point-and-shoot camera, then I would highly recommend this one.  However, make sure you don't put a lot of stress on this large LCD.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Enthusiasts Need Not Apply",
    "Rating": 5,
    "PublishDate": "5/28/2012 1:42:44 PM",
    "LoginNickName": "@Liskrig",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "The battery life while shooting RAW (no flash) gets me about maybe 80 to 100 shots; but if one is going to spend about $400 (at the time of writing this) on a camera, one should be able to afford a spare GENUINE Canon battery.",
    "Pros": "**This review is for the RAW images only**\n\nThis camera has the best manual control relative to its size, the auto-focus is spot on, and the noise level at ISO 800 - 3200 is manageable with software (Lightroom 3/CS5+), the photos that develop from this little beast almost put my Canon 50D, and 1D to shame. The control rings are so useful in capturing the photos that YOU want, and not what the camera THINKS what you want. RAW Images look horrible on the 3\" screen (due to the fact that the images themselves can't be read by the s100) but open them up on your computer and you will simply be BLOWN away. \n\nThe video quality of this camera is INCREDIBLE, FULL HD at 24p, and it looks like a legitimate Hollywood movie. Just look at some of the examples on Vimeo with slight post.",
    "Comments": "This camera is marketed towards pro's and advanced amateurs that are not sure if investing in a dSLR is worth the money. I can confidently tell you (Graduating college for Digital Photography) that all you will need is this camera, and a few hours learning apature, shutter speed, and ISO matching and you will never need a dSLR.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera",
    "Rating": 5,
    "PublishDate": "4/14/2012 1:28:36 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "HDR has to be used with a tripod, too bad it isn't able to be held by hand or adjusted in camera to change the exposure times for each picture being taken.",
    "Pros": "Tons of features, can use in almost any situation easily.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Awesome Compact Digicam",
    "Rating": 5,
    "PublishDate": "2/21/2012 2:59:24 PM",
    "LoginNickName": "Uncle Zeke",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Somewhat short battery life.  Might want to get a spare.",
    "Pros": "Small - It is a compact camera after all.\nWell Built - Surprisingly solid and hefty.  Much better than the SX230.\nLarger image sensor than your typical compact.  Only 12 MP but the larger sensor has better looking pics than a 16 MP with a smaller sensor. \nAbility to shoot RAW.\nEnough manual controls if you're into that.",
    "Comments": "Quiet is spelled quiet, not quite.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]