[
  {
    "Title": "Goofy Lense Cover Can Go",
    "Rating": 4,
    "PublishDate": "1/3/2009 8:28:39 AM",
    "LoginNickName": "UTM",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "I'm not a fan of the weird lens cover which is also an on/off switch. It's good because (obviously) it covers the lens and keeps it free of debris or smudges, but whenever I have it packed in my pocket or backpack it has a tendency to pop open, thereby turning the camera on. I've killed a few batteries because of this. It isn't as big of a deal if you turn on the power saving, but I don't care for the power saving feature because you have about 15 secs to take a picture before it shuts down on you. I wish they would have added a setting that allows you to deactivate the on/off switch feature of the lens cover, but if it's there I haven't found it yet. Because of this one annoyance I'm wondering if I shouldn't have gone ahead and spent the extra $50 to get the 1030SW.",
    "Pros": "Shock-, water-, and freeze-proof is nice because I'm big on mountain activities. It's compact (deck of cards) so it is easy to pack or carry into any situation. It reliably takes very nice pictures (DSLR quality) IF you learn how to use it. The menus are fairly simple but extensive, which is a gripe for some people but I didn't mind taking the time to learn how to use my new $300 toy. The \"auto\" mode works fairly well for most photos in normal light. There are a number of \"scenes\" to select from that will adjust the camera's setting so a specific situation (snow, action, candle light, fireworks, etc); I like these and I was impressed with how many scenes the camera offers (23 of them, I believe). Beyond that the menus can be used to adjust the settings for the camera almost as specifically as you would for an SLR.",
    "Comments": "The first one of these I purchased had some type of short. It would turn on and off all of the time. It would shut down when trying to take pics, turn on while it was just sitting on the table, even with the cover closed. It just wasn't right so NewEgg RMAed it for me and I had a new one within 3 weeks. My new one works as it should.\n\nI don't use the tap feature included on this camera. Seems like a good enough idea but I just leave it turned off. However, in playing with it I noticed that the user does need to calibrate it.\n\nUses an Olympus-specific battery with a charger. Battery lasts for a while, if your lens cover stays shut. Pick up an extra battery and keep it charged if you plan to be away from your charger for several days.\n\nA mini tripod is really handy for this camera. It can take long exposure shots in the dark so you want to be able to keep it very still.\n\nA little camera wallet might help keep the cover closed.\n\nOverall, I am very happy with this purchase.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Step backward.",
    "Rating": 2,
    "PublishDate": "12/31/2008 1:34:38 PM",
    "LoginNickName": "AznJunkie",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Very slow performance (power on and auto focus).  Indoors and low light proformace is very slow. Image quality is questionable, daytime pictures are pretty good, but nighttime/low light pictures are pretty bad. Battery doesn’t last that long so be sure to pick up a spare. Tap function is a nice concept, but doesn’t offer enough choices and sometime it isn’t responsive.  No optical Image Stabilization, the digital Image Stabilization is quite useless as it only increase the ISO which makes your pictures grainy.",
    "Pros": "Waterproof and shockproof. Build quality seems pretty good and doesn’t feel cheap. Lots of shooting modes to help get the type of picture you’re trying to take. 10MP and fast 3X optical zoom. Easy to use interface.",
    "Comments": "I previously owned a Stylus 850SW and I would recommend getting the 850SW over the 1050SW as I’m disappointed with the 1050SW. The 850SW performance so much better than the 1050SW and I feel the image quality is better even though the 850SW is 8MP. I honestly feel Olympus drop the ball on this model. I feel it’s a step backward than a step forward. If you’re looking for a waterproof camera go for the Styles 850SW or the 1030SW.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "NEED AWESOMENESS?",
    "Rating": 5,
    "PublishDate": "10/28/2008 4:15:17 PM",
    "LoginNickName": "fmydog",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "There arnet many cons to this camara, if i had to pick something that annoys me i whould have to say its the tapping feature they should have thought that one through better but i give them a (A) for effort, inovators they are.",
    "Pros": "*Works great in the water/ Took into the shower and took amazing photos of the water hitting the surface of objects.\n*Works great in the daytime, captures everything that you can phyiscaly see with your own two eyes\n*Works great in the dark, has a niffty led light to show you at night or in a dark room what you are looking at. Also has a sensor built into it that takes out bright objects and makes them dimmer so it looks more real in the end photo.\n*Has many cool features i spent a whole day messing with the panaram mode, you take the first picture then it guieds you along for the other 3 pictures to creat a very wide 3-4 picture panaram view / AWESOME and works great.\n*practiced dropping it on many surfaces and still works fine, even concret from about 6 feet up (head level) had a guy bump into me over lanoleum and he freaked out when i dropped it but long story short we had a good laugh.",
    "Comments": "Ummmmm to sum this all up i must mention neweggs awesome customer service i couldnt make the deadline for the free Xd 2 Gb card so they gave me 10$ off very awesome are they :) I love newegg. I preplan my paychecks accordningly.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]