[
  {
    "Title": "A great Camera",
    "Rating": 5,
    "PublishDate": "11/12/2007 7:47:44 AM",
    "LoginNickName": "Tim",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None",
    "Pros": "The D200 is a wonderful camera.  It is big, robust, and built like a tank.",
    "Comments": "If you were ignorant you may order this camera and find out it is big and heavy, and then blame the camera. (It is not a compact point and shoot!)  It is a big professional grade DSLR. It is made for people who know how to use cameras and all the features such as manually setting aperture, shutter speeds, ISO levels, using RAW Format ect.  \n\nIf you're not sure what any of that stuff is, you need to buy a point and shoot.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Heavy Metal",
    "Rating": 2,
    "PublishDate": "10/19/2007 6:41:49 AM",
    "LoginNickName": "meatr",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "This camera is really big and VERY heavy. You should go to a camera store and hold one before you buy this; you can't return it for a lighter model, or get a refund for your money.",
    "Pros": "I guess its supposed to take good pictures, but all of the Nikon cameras do.",
    "Comments": "Too big, too heavy, too expensive. Do your homework; I wish I had handled this model before I ordered it.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Nikon D200",
    "Rating": 5,
    "PublishDate": "10/5/2007 11:17:03 AM",
    "LoginNickName": "taclt",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "A little pricey and heavy but well worth it when you look at your pictures.  If you don't know cameras / photography well you may get a little confused at first but camera is easy to use if you read the manual.",
    "Pros": "The D200 is an outstanding camera.  I have a Coolpix 995 which I thought was great but the D200 blows that camera way hands down.  I bought a Sigma 500mm lens for it and get nothing but outstanding pictures.  It's a little heavy with the 500mm lens on it but you can beat the quality of the pictures.  Also the rapid shot setting is great when you use a high speed  flash card.  I was at Denali Park in Alaska and got great action shots of Moose and grizzly bears. I bought the upgraded battery with rapid charger so I didn't have any problems with battery life but don't know about the standard battery.  A MUST BUY for anyone into taking GREAT pictures.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "",
    "Rating": 5,
    "PublishDate": "6/23/2007 12:13:12 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "None!  Only extreme soberness as I nearly bought something else, which would've been a serious mistake that I don't want to think about!",
    "Pros": "I TRULY LOVE THIS CAMERA,and cannot imagine how close I came to nearly buying something else!  After a couple of days of learning all the features, all I can say is that this camera is simply AMAZING!   Picture QUALITY is AWESOME!  Noise is ~non existent at ISO 100!  As the ISO increases (I've got mine set to auto ISO), but as the ISO increases, the noise reduction increases gradually starting at ISO 400.  So I've got my noise reduction set to low for the highest level of sharpness, and have increased the sharpness as well as I PREFER abnormally SHARP and CRISP images, making this camera's images VERY sharp and distinct with ~zero noise!  I have compared a lot of different cameras, and there is absolutely nothing that compares or comes anywhere close to this AMAZING camera!  It is truly the best built, most RUGGED camera that I have ever seen! Sure, there are more expensive cameras, but in side by side picture comparisons, the slight difference isn't worth considering!",
    "Comments": "I've been an extreme shutterbug for 30+ years, and have used a lot of different well made 35mm as well as digital SLR cameras.  After owning the D200, all I can say is that I'll never own anything else but Nikon!  Its no wonder why Nikon enthusiasts are  Nikon enthusiasts for the rest of their life!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great SLR",
    "Rating": 5,
    "PublishDate": "5/28/2007 8:36:23 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The camera is heavy, but that gives it a quality, solid feel.",
    "Pros": "I bought this camera to replace my D70.  I liked my D70, but I can’t say enough about the D200.  It captures fantastic images.  The layout is intuitive and the construction is solid.  The camera can shoot fast, and the color is dead on",
    "Comments": "I looked at the D80 and I decided the D200 was worth the jump in price.  The construction is better.  I like CF cards and the 18-70mm lens is better than the 18-135mm that is often sold with the D80.  If you are buying a DSLR, I don’t think you can get much more camera for the price.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "USA Warranty",
    "Rating": 5,
    "PublishDate": "5/28/2007 7:45:26 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None",
    "Pros": "This is not Grey Market.  Mine was USA warranty.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Awesome Camera",
    "Rating": 5,
    "PublishDate": "11/9/2006 5:13:13 PM",
    "LoginNickName": "Darrin",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Might be out of the average Joe's price range. There's always the D70s, and the D80 will be out soon as well.",
    "Pros": "I upgraded from the Nikon D70 which I loved. Smart choice, this camera shoots like a pro even if I don't. Fast, Crisp, Perfect Color.",
    "Comments": "I bought this after reading numerous reviews and doing weeks of research. You'd be surprised to learn many pro's shoot with this even with more expensive models out there. I see why. Go with Nikon, great company, great products.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]