[
  {
    "Title": "Lumix LX7",
    "Rating": 5,
    "PublishDate": "12/19/2013 5:39:15 PM",
    "LoginNickName": "Qix",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "LCD is not articulating but is large and has almost a Million pixels. The EVF is sold separately and is quite expensive but would make it larger. ISO over 100 seems noisy to me but I am super picky about that and I don't think that's unusual, for this size of sensor. Battery seems short lived per charge but its not much bigger than a book of matches. The ND / manual focus button seems a bit flimsy but that might just be because the other parts feel so solid.",
    "Pros": "!.4 Leica lens is a step above the rest, for this price point of camera. Its super small size was its main selling point for me. The LX7 has an outstanding LCD that is easy to see. It has more external controls on it than others also, like aperture ring, manual/auto/macro focus slider and even aspect ratio. ND filter built in, is a nice, if not necessary inclusion with a 1.4f  lens. Everything feel solid and well thought out. The flash pops out with authority and feels solid once ready to fire. Picture in RAW at 100 ISO almost rival my DSLRs.",
    "Comments": "I took a long while picking this out. Weeks maybe. Only the Sony RX100 seemed to be better at this size but it was far more costly. Leica sells almost the same camera but again, for much more cost. This seemed like a good mix for my needs of size, quality and cost. If you are looking at this camera, it's size should be its main selling point I think. You can get more camera for the same cost but it will be bigger. The extra you may pay for the red dot, is an endless debate and I can't help there. The LX7 gets outstanding reviews at reputable sources and I can understand why. It is not without flaws but for the size and price, I am more than pleased with this small shooter!",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]