[
  {
    "Title": "A Good Camera For The Car",
    "Rating": 5,
    "PublishDate": "8/20/2011 7:20:43 PM",
    "LoginNickName": "ThisOtherChick",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "It's kinda bulky then newer cameras",
    "Pros": "Great quality and easy to use. Has the auto face detect although it could be tricky but once you get used to it, it's not a big deal.",
    "Comments": "Nice camera to have in your car in case of accidents",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Works great",
    "Rating": 5,
    "PublishDate": "3/8/2009 4:46:17 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "none so far.",
    "Pros": "Quality and performance is great.",
    "Comments": "Highly recommended! I could not find a better camera for the price.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "great camera",
    "Rating": 5,
    "PublishDate": "1/1/2009 9:03:26 AM",
    "LoginNickName": "citter",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "wasn't free....could have a wide option...",
    "Pros": "good picture taken camera...face detec works well, vibrant color reproduction,,,easy to use, good battery life.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great upgrade from SD1100IS",
    "Rating": 5,
    "PublishDate": "12/20/2008 4:33:59 PM",
    "LoginNickName": "FatBellyIndian",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None",
    "Pros": "Great upgrade. Not really needed, but I guess more it better...10.0 MP compared to 8.0 SD1100IS. Great Camera. Quality is superb.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Just bought a second SD770 from Newegg",
    "Rating": 5,
    "PublishDate": "11/11/2008 9:45:57 PM",
    "LoginNickName": "harrier",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "For its price, none.",
    "Pros": "We liked my wife's SD770 (also from Newegg) so well that we just bought a second from Newegg so I could carry one about as well. Beautiful little camera with excellent resolution and features. I could get a fancier camera, but it would sit at home most of the time.\n\nNewegg rocks!",
    "Comments": "Sharp close focusing takes a bit of practice, but works very well when mastered.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Good Cam For The Money",
    "Rating": 5,
    "PublishDate": "11/5/2008 4:04:29 PM",
    "LoginNickName": "Dragon",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "IF YOU'RE OCD LIKE MYSELF THE FINGERPRINTS WILL KINDA BOTHER YOU BECAUSE YOU CAN SEE THEM ALL ON THE CAMERA BUT ITS REALLY NOT THAT BAD. NOT TOO MANY COMPLAINTS ABOUT THE CAMERA.",
    "Pros": "Easy menu use. Different picture view menus just by touching the zoom. Takes pretty decent quality pictures and at 10MP the pictures are HUGE files so even when u shrink them down they still look great. I have had this camera for a little over a month and have taken it A LOT of places with me and have taken A LOT of pictures. The best part is that I havent ever even had to charge my battery yet other than the initial charge. Good sleek camera that picks up nice pics. All around good for the money.",
    "Comments": "If youre just looking for a camera to snap some special times to put in your album, if you want a good quality camera or even if its just a camera for your kids.. this camera is easy to use, affordable and worth the money.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera",
    "Rating": 5,
    "PublishDate": "10/17/2008 1:15:52 PM",
    "LoginNickName": "Harju",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "I didn't buy it when it first came out.",
    "Pros": "Excellent camera.  Easy to use.  Takes great pictures.  Attractive case.  Nice size LCD screen.  Optical viewfinder.  Powers up to ready state extremely fast.  Perfect size for pocket.",
    "Comments": "Put it in your shopping cart.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great",
    "Rating": 5,
    "PublishDate": "9/20/2008 10:31:20 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "None",
    "Pros": "The pictures are great quality and the shutter speed is nice too.  I've hardly had any pictures come out blurry.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Very nice little camera.",
    "Rating": 5,
    "PublishDate": "9/3/2008 9:45:37 PM",
    "LoginNickName": "Mike",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Can't rewind time when you're too slow to take a shot.  Can't make your friends more attractive.  I would like higher zoom, but I could have bought the higher model.  Can't adjust shutter speed in manual mode (unless I haven't figured it out yet).  Just nitpicks.  Maybe I'll find more to complain about when I've had it for longer.",
    "Pros": "Takes great pictures of my kids, just what I bought it for.  Very fast to start up and to take a shot.  The face detection and instant red-eye removal seem to work well (and are even fun to watch the first few times).  Fits great in my pocket, even in a thin padded case.  I was worried about the battery, but it lasts- I've been recharging it about once a week, but it's only needed it once.  I usually take max 100-200 pictures a week.",
    "Comments": "Why no other reviews?  Everyone else who bought one must be out taking pictures.  Three other people I know have bought or will buy this after seeing mine.  When you connect the USB cable it doesn't show up as a USB drive like many cameras do, but it shows up on my Fedora and XP (after installing a driver, iirc) systems as a 'Canon camera', and lets you click and drag your pictures.",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]