[
  {
    "Title": "Returning review - Great Camera",
    "Rating": 5,
    "PublishDate": "7/2/2011 11:02:17 PM",
    "LoginNickName": "jbeazell",
    "BoughtTimeTypeString": "more than 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The camera does suffer one fairly large flaw.  There is a loudly audible 'clicking' noise when taking videos.  It clips out the sound in the scene and makes watching the videos a bit obnoxious.  \n\nIt really isn't a con, but you have to be absolutely meticulous about the USB and battery door openings.  It only takes a hair or a piece of sand (which is almost never near any natural sources of water!) to get in the seal and make it no longer water proof.  I know that this is what happened to mine (after 3 years) and I'm sure that is what happened to other reviewers complaining of it not being very waterproof.  I didn't baby may camera, but I made absolutely sure that the seals were clean before closing them and taking it into the water.",
    "Pros": "I've Now owned this camera for 3 years, and it has done me well.  I have dunked it, dented it, froze it in harsh Montana winters and taken long underwater adventures with it.  The photo quality is superb, even for a compact camera.  The zoom is adequate but small.  The controls are well laid out and the menu navigation is easy to use.  I have a 2GB M+ card and have only filled the thing twice since owning it.  The battery gave out before I ran out of space.  I picked up an extra battery for about $15, so that's not an issue any longer.  If you read the manual and understand the settings, you'll have an incredible pocket camera that happens to be daily life proof (and kid proof and weatherproof).",
    "Comments": "The camera has finally developed a very small water leak.  There is condensation visible on the lens and on the inside of the LCD display.  The camera still seems to be functional, however.  The condensation on the lens doesn't make for quality photos any longer.  I am going to leave the doors open on it and dry it in the sun for a few days to see if I can get it to evaporate away.  I won't be taking into the water any more.  That's a shame.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "DOLICA KIT1 3-in-1 Ultra slim Camera Kit is wrong for this camera",
    "Rating": 4,
    "PublishDate": "9/27/2008 11:45:17 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "average",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "xD M+ memory cards do not fit most computer's memory card readers. No card adapter was provided so there is no easy way to pop the xD card out of the camera and into a computer. You need to buy xD M+ cards to record video.",
    "Pros": "Haven't owned it that long. Screen is bright and vivid.",
    "Comments": "Newegg provides DOLICA KIT1 3-in-1 Ultra slim Camera Kit as a free option for buying the camera. However, the screen protector is the wrong size (2.5\") so it is of no value. The camera case has a single zipper on the side which means the camera strap can't be used while the camera is in the case. \n\nSince the kit is free with the purchase you can't get an RMA and it will cost you more in postage than the kit.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great camera with mediocre image quality",
    "Rating": 4,
    "PublishDate": "9/2/2008 12:48:17 PM",
    "LoginNickName": "spigot",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Less than stellar image quality. When outside the sun casts a reflection across the viewfinder, which also shows up in the final image. If I use my hand to shade the lens I can minimize this, so I guess its a good thing you can shoot with one hand.\nI'm used to using a Nikon dslr, so using a point and shoot with its limited controls is disappointing, but I knew that going in. I wish there was a saturation setting I could bump up a bit.",
    "Pros": "A very compact and useable camera, the controls are quick and intuitive. A fairly fast startup time means  I miss less shots. I use this camera in the outdoors on hikes and when I need to be lightweight. It fits that niche perfectly with good battery life and of course the waterproof and shockproof features.",
    "Comments": "If you need a good waterproof, shockproof camera, this is top notch, just be prepared to spend some time in photoshop to fix certain things like saturation and exposure.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "great all around camera",
    "Rating": 4,
    "PublishDate": "9/1/2008 12:57:50 PM",
    "LoginNickName": "jbeazell",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The image quality isn't going to match a full-frame CCD dSLR 10 MP camera.  Then again, if you need that kind of quality, don't expect it from a non-dSLR camera.  There IS a price to pay for that kind of quality.  This camera performs exceptionally well, for the size of the camera and the size of the CCD chip.  You have to read and understand the camera quality settings before getting 'great' shots.  Also, there isn't single camera in thie category that will perform 'perfectly' in low-light situations without indepth knowledge of what you're doing, and a tripod.  That being said, this camera exceeded my expectations for night shots at the amusement park.  The ONLY con I can give this camera is that it does not have full-manual control.  Then again, I purchased this camera as a point and shoot.  If I want fully auto, I'll lug my dSLR.  Also, for a rugged camera, the high-gloss exterior tends to show off its battle scars well.  I would have preferred a matte or rubber finish.",
    "Pros": "This camera has many pros to offer.  It's a 10 MP, low noise (with proper ISO settings), moderate zoom, small, and of course, water, crush, freeze, drop proof.  It is a rugged little camera that can take a good beating.  I've taken it to an amusement park, with a water park, and attempted to abuse the camera.  It came through 2 days abuse without a single blemish.  Well, I managed to scratch the high-gloss exterior, but that's just a scratch.  I had no fears of water ingress.  The batter managed to last all 10+ hours of use (granted I didn't keep it 'on' all 10 hours).  When used with an Olympus M+ XD card (2 gig), I was able to shoot panoramic shots, and many 5 min.+ videos.",
    "Comments": "There are some reviews that state that this camera doesn't take fantastic shots, and then attempt to compare this to a dSLR camera.  This isn't a dSLR camera, and comparing it to one would be like berating a Ford Focus because it isn't as fast as an F1 car.  For the category that this camera falls into, it performs exceptionally well.  When you take into account that it is also waterproof, crushproof, dropproof, and freezeproof, it absolutely mashes the competition.  If you are considering getting a compact point-n-shoot camera, this should be in everybody's top-5 cameras to consider.  How many other cameras can offer you underwater AND under-freezing videos and 10MP shots in the same package?",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Cayman Islands Tested",
    "Rating": 5,
    "PublishDate": "8/2/2008 7:58:37 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Zoom could use some improvement.",
    "Pros": "This little baby worked as advertised.  I spent most of the time in the water along the Seven Mile Beach in the Caymans and took fabulous pictures while snorkeling and in the pool at the hotel.  Underwater shots were magnificent! You need to order the Olympus XD M+ (Plus) memory cards to record videos longer than 10sec.  I took a lot of videos to and had plenty of memory left on the 2 gig card to take over 1000 pictures!",
    "Comments": "The camera has a lot of editing features and the panoramic options are very good.  The camera produces a good slide show to display your pictures on a TV easily.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Sweet!!",
    "Rating": 5,
    "PublishDate": "6/29/2008 11:31:19 AM",
    "LoginNickName": "Mrav8er",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Coming off an older Canon that used AA batteries, I don't like the proprietary battery.  Now I have to keep track of the charge, but the trade off is a small size.\n   One minor design flaw that I see is  that the back of the camera is completely flat and flush with the screen.  This camera is billed as a shock/water proof unit, inviting heavy use.  If you leave this camera face up and it slides around, it runs the risk of scratching the screen.  It should have been recessed by 2-3 mm.  Some nice accessories (floating strap, rubber camera wrap) only available through Oly.",
    "Pros": "What a cool little camera!  This thing takes very nice shots both on land and underwater + underwater video!  Compact, tight feel, good battery life, lots of pre-configured modes.  This little guy does it all.  TOTALLY WATER PROOF!  Nice big screen. No big deal breakers here.",
    "Comments": "Manufacturer actually recommends putting it under the tap to rinse it off after pool/ocean entry. This camera doesn't truly outshine any other one in picture quality, though it is very good.  This camera excels as a great rough and tumble camera that you don't have to worry about.  The added dimension of using it underwater opens up a lot of fun situations (kids in pools for example) that land cameras can't.  I fully plan to buy the underwater housing for it to take it diving and get below the 33 foot limit it has.  The plus here is that if a housing leaks, it will wreck the camera.  Not this one! It can take some water and not care.  While I love Newegg and they can't be beat for order/shipping, this was significantly cheaper out on the net.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "AWSOME camera",
    "Rating": 5,
    "PublishDate": "6/5/2008 11:51:25 AM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 week to 1 month",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The only tough thing is the zoom does not go that far.",
    "Pros": "I have had many cameras and this one is by far the best.  It is great for throwing around and taking to beach.  It works great in water and out! There are so many different options and settings.  It is perfect for taking just about any sort of picture.  It fits right in your pocket.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Olympus Stylus 1030 Green",
    "Rating": 4,
    "PublishDate": "5/9/2008 8:09:49 PM",
    "LoginNickName": "WyoRip",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "You need to order the Olympus XD M+ (Plus) memory cards to record videos longer than 10sec. I didn't know this and purchased 2 x 2gb M xd chips. I only could find them on the Olympus webpage to order, ordered 2 x 2gb M+ at $38 a peice.",
    "Pros": "RUGGED ! ! ! Put on an lcd protector and a sleek silicone skin. I'm ready for Memorial Day in the Rocky Mts. I've had a Stylus 300 All Weather for the last 5 years. It has worked great. I've taken over 5,000 photos. It still works great. I was ready for an upgrade. Video with sound,,, These cameras are worth the extra money. I've ATV'd, boated, hunted in extreme conditions and they keep on working.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Amazing camera!",
    "Rating": 5,
    "PublishDate": "4/21/2008 2:34:09 PM",
    "LoginNickName": "Trulok",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Cons... Only a 3.6x zoom is a downside to some. However being a 10.1 mega-pixel camera, I rarely zoom in anyways. Another con would have to be everyone will want your camera, considering my 770sw was stolen, trust me I know!",
    "Pros": "I first owned the 770sw but it was misplaced/stolen. NewEgg has the  best price on this camera  at 340$ vs the usual 400$. Rhe 1030sw is overall a great upgrade to the 770sw. The most obvious pro of the 1030sw is its extreme durability and seamless above/below water transitions. The controls are much faster and smoother. One feature that drove me crazy on the 770sw was the video mode had to be selected each time you turned the camera on. I can leave the 1030sw in video mode for quick follow up videos, or switch back to pictures in an instant. The 1030sw easily fits in my pocket without worry of bouncing it around to much. 3.6 zoom is pretty nice considering its all inside the camera. The beautiful anodized green finish tops everything off!",
    "Comments": "If you price other pocket cameras they all come pretty close together, including the stylus SW series. However, I keep my 1030sw in my pocket at the beach, around my neck tubing down the river, sitting out camping at below freezing, or even strapped to my wrist while swimming/diving in the water. I've taken some great videos 20+ feet underwater that I would never dream of with another camera. The ability to take the 1030sw pretty much anywhere gives you chances for shots you would never dare try with any other camera. Buy the 1030sw!",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]