[
  {
    "Title": "Excellent!",
    "Rating": 5,
    "PublishDate": "6/22/2011 5:06:39 PM",
    "LoginNickName": "Dirk",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Micro SD memory card\nSlow speed\nlack of external charging source\nflimsy charging door cover",
    "Pros": "Small size. Battery life. \nGood quality photos indoors and out. \nFront screen.\nInexpensive.\nSamsung quality.",
    "Comments": "This takes a micro SD card. This is confusing since Newegg offers a free regular SD card. This is easily rectified by buying an inexpensive micro SD card on either eBay or Newegg. Also external chargers are available on eBay at affordable prices. These solutions solve all of the problems except the slow speed. All in all a great little camera at an affordable price. Thank you.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Camera may be fine.  Free kit was not",
    "Rating": 3,
    "PublishDate": "6/18/2011 6:56:16 PM",
    "LoginNickName": "J. E.",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "The free kit comes with a case.  It also comes with a 4gb SD memory card.  Unfortunately the camera only takes MicroSD and Micro SDHC.  My biggest gripe is that I ordered this to take on a 2 day trip and because the memory card was wrong I was stuck with my old lousy camera.  I would have paid for the card to come in the shipment if the \"Free kit\" didn't fool me.  The trip was irreplaceable and It annoys me that I could not get the quality of picture that I had hoped.  Again the camera is fine but the false sense of what the kit had is why I give it 3 eggs.",
    "Pros": "I researched this camera and it had the features I was looking for.  Decent optical zoom, compact, front LCD.  The free kit was a bonus (no need to go hunt for a case and memory card because the kit has them), but...",
    "Comments": "I have ordered from Newegg consistently and this is my first really bad experience.  I hope they get this kind of stuff cleared up.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Decent Camera",
    "Rating": 5,
    "PublishDate": "6/18/2011 1:41:49 PM",
    "LoginNickName": "ptchfrk",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "Micro SDHC card. It's not that big of a deal except in my case. All of my cards are standard SDHC cards, so I'll be taking a bit of time switching out.\n\nUnderstand, it utilizes a MICRO SDHC CARD only.",
    "Pros": "14.2 Megapixel.\nWide Angle.\nFront display.\nExcellent battery life.\nCame with camera case :) and a standard SDHC card :(\nGreat bang for the buck!",
    "Comments": "I guess I should have gone online and checked the manual for this model prior to purchasing. I also own the Samsung TL-205 (12.2 megapixel), also with the front display but it takes the standard SDHC card. This camera is a 14.2 megapixel model and takes a noticeably crisper picture + has the added advantage of a wide angle lens.\n\nI'm convinced that Newegg should not allow anyone to write a review unless they at the very least possess the item their reviewing. If your asking where is the front display? It's obvious you haven't even held the product. Therefore, nobody wants your ridiculous opinion!",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Great Camera for Great Price",
    "Rating": 5,
    "PublishDate": "6/15/2011 4:45:30 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "1 month to 1 year",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": true,
    "Cons": "MicroSD, not as \"fast\" as anticipated.",
    "Pros": "Front Facing LCD\n720P Video Recording\nGreat Quality, 10Mega Pixel Wide pictures, 14MP 4:3 pictures",
    "Comments": "Great camera over all.  I got one for $179.99 about 4 to 5 month ago.  Now it drops to $99.99 with free 4GB MicroSD, and Free Camera carrying case.  Not exactly a camera that holds its value.  But I left the camera oversea, and forgot to take it back, so when I see this deal, I was very happy, and bought it again right away.  Not like the other reviewer said, first, it's not a Sony.  Second, the front facing LCD is in the picture, if you don't own the product, delete your post.  If you own the product, charge it, and turn it on, so you will see the front LCD.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Ignore First Feedback",
    "Rating": 5,
    "PublishDate": "6/14/2011 9:59:44 PM",
    "LoginNickName": "Nside",
    "BoughtTimeTypeString": "1 day to 1 week",
    "TechLevelTypeString": "Somewhat High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Just balancing out the misguided first review",
    "Pros": "Front LCD screen is on the front, it blends into the body until it's turned on. Look at the picture of the box if you need proof.\n\nIt's a Samsung, NOT a Sony.",
    "Comments": "People, please don't review an item unless you actually OWN the product. Newegg, you should have a \"Report\" button for reviews so we can flag users such as the first reviewer. \"Reviews\" like that don't help anybody, and just misinform or confuse people who are actually looking at this product.\n\nPlease delete the first review, then delete this one. Thank you.",
    "TotalConsented": 0,
    "TotalVoting": 0
  },
  {
    "Title": "Where is the Front LCD Screen?",
    "Rating": 1,
    "PublishDate": "6/14/2011 1:24:21 PM",
    "LoginNickName": "",
    "BoughtTimeTypeString": "less than 1 day",
    "TechLevelTypeString": "High",
    "IsNewReview": true,
    "PurchaseMark": false,
    "Cons": "Where is the advertised Front LCD Screen? Looks like the pictures don't match the product description.",
    "Pros": "Sony quality is generally good.",
    "Comments": "",
    "TotalConsented": 0,
    "TotalVoting": 0
  }
]